package com.yuchting.yuchberry.server;

import java.io.ByteArrayInputStream;
import java.io.ByteArrayOutputStream;
import java.io.InputStream;
import java.io.OutputStream;
import java.util.Vector;
import java.util.zip.GZIPInputStream;
import java.util.zip.GZIPOutputStream;

class sendReceive extends Thread{
	
	OutputStream		m_socketOutputStream = null;
	InputStream			m_socketInputStream = null;
	
	
	private Vector		m_unsendedPackage 		= new Vector();
	private Vector		m_unprocessedPackage 	= new Vector();
	
	boolean			m_closed				= false;
		
	public sendReceive(OutputStream _socketOut,InputStream _socketIn){
		m_socketOutputStream = _socketOut;
		m_socketInputStream = _socketIn;
				
		start();
	}
		
	//! send buffer
	public synchronized void SendBufferToSvr(byte[] _write,boolean _sendImm)throws Exception{	
		m_unsendedPackage.addElement(_write);
		
		if(_sendImm){
			SendBufferToSvr_imple(PrepareOutputData());
		}
	}
	
	public void CloseSendReceive(){
		
		if(m_closed == false){
			m_closed = true;
	
			m_unsendedPackage.clear();
			m_unprocessedPackage.clear();
						
			interrupt();
			

			/* the server cant close the socket ...
			 * 
			try{
				m_socketOutputStream.close();
				m_socketInputStream.close();
			}catch(Exception _e){}
			*/
			
			while(isAlive()){
				try{
					sleep(10);
				}catch(Exception _e){};			
			}	
		}		
	}
	
	private synchronized byte[] PrepareOutputData()throws Exception{
		
		if(m_unsendedPackage.isEmpty()){
			return null;
		}
		
		ByteArrayOutputStream t_stream = new ByteArrayOutputStream();
				
		for(int i = 0;i < m_unsendedPackage.size();i++){
			byte[] t_package = (byte[])m_unsendedPackage.elementAt(i);	
			
			WriteInt(t_stream, t_package.length);
						
			t_stream.write(t_package);
		}
		
		m_unsendedPackage.removeAllElements();
		
		return t_stream.toByteArray();
	}
	
	//! send buffer implement
	private void SendBufferToSvr_imple(byte[] _write)throws Exception{
		
		if(_write == null){
			return;
		}		
		
		OutputStream os = m_socketOutputStream;
		
		ByteArrayOutputStream zos = new ByteArrayOutputStream();
		GZIPOutputStream zo = new GZIPOutputStream(zos);
		zo.write(_write);
		zo.close();	
		
		byte[] t_zipData = zos.toByteArray();
		
		if(t_zipData.length > _write.length){
			// if the ZIP data is large than original length
			// NOT convert
			//
			WriteInt(os,_write.length << 16);
			os.write(_write);
			os.flush();
			
		}else{
			WriteInt(os,(_write.length << 16) | t_zipData.length);
			os.write(t_zipData);
			os.flush();
			
		}
				
	}
	
	public void run(){
		
		try{
			
			while(!m_closed){
				SendBufferToSvr_imple(PrepareOutputData());
				sleep(500);
			}
			
		}catch(Exception _e){}
		
	}

	//! recv buffer
	public byte[] RecvBufferFromSvr()throws Exception{
		
		if(!m_unprocessedPackage.isEmpty()){
			byte[] t_ret = (byte[])m_unprocessedPackage.elementAt(0);
			m_unprocessedPackage.removeElementAt(0);
			
			return t_ret;
		}
		
		InputStream in = m_socketInputStream;

		int t_len = ReadInt(in);
		
		final int t_ziplen = t_len & 0x0000ffff;
		final int t_orglen = t_len >>> 16;
				
		byte[] t_orgdata = new byte[t_orglen];
				
		if(t_ziplen == 0){
			
			ForceReadByte(in, t_orgdata, t_orglen);
			
		}else{
			
			byte[] t_zipdata = new byte[t_ziplen];
			
			ForceReadByte(in, t_zipdata, t_ziplen);
			
			GZIPInputStream zi	= new GZIPInputStream(
										new ByteArrayInputStream(t_zipdata));

			ForceReadByte(zi,t_orgdata,t_orglen);
			
			zi.close();
		}
		
		byte[] t_ret = ParsePackage(t_orgdata);
		t_orgdata = null;
		
		return t_ret;
	}
	
	private byte[] ParsePackage(byte[] _wholePackage)throws Exception{
		
		ByteArrayInputStream t_packagein = new ByteArrayInputStream(_wholePackage);
		int t_len = ReadInt(t_packagein);
					
		byte[] t_ret = new byte[t_len];
		t_packagein.read(t_ret,0,t_len);
		
		t_len += 4;
		
		while(t_len < _wholePackage.length){
			
			final int t_packageLen = ReadInt(t_packagein); 
			
			byte[] t_package = new byte[t_packageLen];
			
			t_packagein.read(t_package,0,t_packageLen);
			t_len += t_packageLen + 4;
			
			m_unprocessedPackage.addElement(t_package);			
		}		
		
		return t_ret;		
	}
	// static function to input and output integer
	//
	static public void WriteStringVector(OutputStream _stream,Vector _vect,boolean _converToSimpleChar)throws Exception{
		
		final int t_size = _vect.size();
		WriteInt(_stream,t_size);
		
		for(int i = 0;i < t_size;i++){
			WriteString(_stream,(String)_vect.elementAt(i),_converToSimpleChar);
		}
	}
	
	static public void WriteString(OutputStream _stream,String _string,boolean _converToSimpleChar)throws Exception{
		
		final byte[] t_strByte = _converToSimpleChar?complTosimple(_string).getBytes("UTF-8"):_string.getBytes("UTF-8");
		
		WriteInt(_stream,t_strByte.length);
		if(t_strByte.length != 0){
			_stream.write(t_strByte);
		}
	}
	
		
	static public void ReadStringVector(InputStream _stream,Vector _vect)throws Exception{
		
		_vect.removeAllElements();
		
		final int t_size = ReadInt(_stream);
				
		for(int i = 0;i < t_size;i++){
			_vect.addElement(ReadString(_stream));
		}
	}
	
	static public String ReadString(InputStream _stream)throws Exception{
		
		final int len = ReadInt(_stream);
		
		if(len != 0){
			byte[] t_buffer = new byte[len];
			
			ForceReadByte(_stream,t_buffer,len);

			return new String(t_buffer,"UTF-8");
		}
		
		return new String("");
		
	}
	
	static public int ReadInt(InputStream _stream)throws Exception{
		return _stream.read() | (_stream.read() << 8) | (_stream.read() << 16) | (_stream.read() << 24);
	}
	
	static public long ReadLong(InputStream _stream)throws Exception{
		final int t_timeLow = sendReceive.ReadInt(_stream);
		final long t_timeHigh = sendReceive.ReadInt(_stream);
				
		if(t_timeLow >= 0){
			return ((t_timeHigh << 32) | (long)(t_timeLow));
		}else{
			return ((t_timeHigh << 32) | (((long)(t_timeLow & 0x7fffffff)) | 0x80000000L));
		}
	}
		
	static public void WriteLong(OutputStream _stream,long _val)throws Exception{		
		sendReceive.WriteInt(_stream,(int)_val);
		sendReceive.WriteInt(_stream,(int)(_val >>> 32));
	}

	static public void WriteInt(OutputStream _stream,int _val)throws Exception{
		_stream.write(_val);
		_stream.write(_val >>> 8 );
		_stream.write(_val >>> 16);
		_stream.write(_val >>> 24);
	}
	
	static public void WriteDouble(OutputStream _stream,double _val)throws Exception{
		if(_val == 0){
			WriteInt(_stream,0);
		}else{
			String t_valString = Double.toString(_val);
			WriteString(_stream,t_valString,false);
		}		
	}
	
	static public void WriteFloat(OutputStream _stream,float _val)throws Exception{
		if(_val == 0){
			WriteInt(_stream,0);
		}else{
			String t_valString = Float.toString(_val);
			WriteString(_stream,t_valString,false);
		}
	}
	
	static public double ReadDouble(InputStream _stream)throws Exception{
		String t_valString = ReadString(_stream);
		if(t_valString.length() == 0){
			return 0;
		}else{
			return Double.valueOf(t_valString).doubleValue();			
		}
		
	}
	
	static public float ReadFloat(InputStream _stream)throws Exception{
		String t_valString = ReadString(_stream);
		if(t_valString.length() == 0){
			return 0;
		}else{
			return Float.valueOf(t_valString).floatValue();
		}
	}
	
	static public void ForceReadByte(InputStream _stream,byte[] _buffer,int _readLen)throws Exception{
		int t_readIndex = 0;
		int t_counter = 0;
		
		while(_readLen > t_readIndex){
			final int t_c = _stream.read(_buffer,t_readIndex,_readLen - t_readIndex);
			if(t_c > 0){
				t_readIndex += t_c;
			}else{
				t_counter++;
				
				if(t_counter > 10){
					throw new Exception("FroceReadByte failed to read " + _readLen );
				}
			}
		}
	}
	
	static public String complTosimple(String compl){
        String str="";
        for(int i=0;i<compl.length();i++){
            if(turnCompl().indexOf(compl.charAt(i))!=-1)
                str+=turnSimpe().charAt(turnCompl().indexOf(compl.charAt(i)));
            else
                str+=compl.charAt(i);
        }
        return str;
    }
    
	static public String turnSimpe(){
        return "°¡°¢°£°¤°¥°¦°§°¨°©°ª°«°¬°­°®°¯°°°±°²°³°´°µ°¶°·°¸°¹°º°»°¼°½°¾°¿°À°Á°Â°Ã°Ä°Å°Æ°Ç°È°É°Ê°Ë°Ì°Í°Î°Ï°Ð°Ñ°Ò°Ó°Ô°Õ°Ö°×°Ø°Ù°Ú°Û°Ü°Ý°Þ°ß°à°á°â°ã°ä°å°æ°ç°è°é°ê°ë°ì°í°î°ï°ð°ñ°ò°ó°ô°õ°ö°÷°ø°ù°ú°û°ü°ý°þ±¡±¢±£±¤±¥±¦±§±¨±©±ª±«±¬±­±®±¯±°±±±²±³±´±µ±¶±·±¸±¹±º±»±¼±½±¾±¿±À±Á±Â±Ã±Ä±Å±Æ±Ç±È±É±Ê±Ë±Ì±Í±Î±Ï±Ð±Ñ±Ò±Ó±Ô±Õ±Ö±×±Ø±Ù±Ú±Û±Ü±Ý±Þ±ß±à±á±â±ã±ä±å±æ±ç±è±é±ê±ë±ì±í±î±ï±ð±ñ±ò±ó±ô±õ±ö±÷±ø±ù±ú±û±ü±ý±þ²¡²¢²£²¤²¥²¦²§²¨²©²ª²«²¬²­²®²¯²°²±²²²³²´²µ²¶²·²¸²¹²º²»²¼²½²¾²¿²À²Á²Â²Ã²Ä²Å²Æ²Ç²È²É²Ê²Ë²Ì²Í²Î²Ï²Ð²Ñ²Ò²Ó²Ô²Õ²Ö²×²Ø²Ù²Ú²Û²Ü²Ý²Þ²ß²à²á²â²ã²ä²å²æ²ç²è²é²ê²ë²ì²í²î²ï²ð²ñ²ò²ó²ô²õ²ö²÷²ø²ù²ú²û²ü²ý²þ³¡³¢³£³¤³¥³¦³§³¨³©³ª³«³¬³­³®³¯³°³±³²³³³´³µ³¶³·³¸³¹³º³»³¼³½³¾³¿³À³Á³Â³Ã³Ä³Å³Æ³Ç³È³É³Ê³Ë³Ì³Í³Î³Ï³Ð³Ñ³Ò³Ó³Ô³Õ³Ö³×³Ø³Ù³Ú³Û³Ü³Ý³Þ³ß³à³á³â³ã³ä³å³æ³ç³è³é³ê³ë³ì³í³î³ï³ð³ñ³ò³ó³ô³õ³ö³÷³ø³ù³ú³û³ü³ý³þ´¡´¢´£´¤´¥´¦´§´¨´©´ª´«´¬´­´®´¯´°´±´²´³´´´µ´¶´·´¸´¹´º´»´¼´½´¾´¿´À´Á´Â´Ã´Ä´Å´Æ´Ç´È´É´Ê´Ë´Ì´Í´Î´Ï´Ð´Ñ´Ò´Ó´Ô´Õ´Ö´×´Ø´Ù´Ú´Û´Ü´Ý´Þ´ß´à´á´â´ã´ä´å´æ´ç´è´é´ê´ë´ì´í´î´ï´ð´ñ´ò´ó´ô´õ´ö´÷´ø´ù´ú´û´ü´ý´þµ¡µ¢µ£µ¤µ¥µ¦µ§µ¨µ©µªµ«µ¬µ­µ®µ¯µ°µ±µ²µ³µ´µµµ¶µ·µ¸µ¹µºµ»µ¼µ½µ¾µ¿µÀµÁµÂµÃµÄµÅµÆµÇµÈµÉµÊµËµÌµÍµÎµÏµÐµÑµÒµÓµÔµÕµÖµ×µØµÙµÚµÛµÜµÝµÞµßµàµáµâµãµäµåµæµçµèµéµêµëµìµíµîµïµðµñµòµóµôµõµöµ÷µøµùµúµûµüµýµþ¶¡¶¢¶£¶¤¶¥¶¦¶§¶¨¶©¶ª¶«¶¬¶­¶®¶¯¶°¶±¶²¶³¶´¶µ¶¶¶·¶¸¶¹¶º¶»¶¼¶½¶¾¶¿¶À¶Á¶Â¶Ã¶Ä¶Å¶Æ¶Ç¶È¶É¶Ê¶Ë¶Ì¶Í¶Î¶Ï¶Ð¶Ñ¶Ò¶Ó¶Ô¶Õ¶Ö¶×¶Ø¶Ù¶Ú¶Û¶Ü¶Ý¶Þ¶ß¶à¶á¶â¶ã¶ä¶å¶æ¶ç¶è¶é¶ê¶ë¶ì¶í¶î¶ï¶ð¶ñ¶ò¶ó¶ô¶õ¶ö¶÷¶ø¶ù¶ú¶û¶ü¶ý¶þ·¡·¢·£·¤·¥·¦·§·¨·©·ª·«·¬·­·®·¯·°·±·²·³·´·µ·¶···¸·¹·º·»·¼·½·¾·¿·À·Á·Â·Ã·Ä·Å·Æ·Ç·È·É·Ê·Ë·Ì·Í·Î·Ï·Ð·Ñ·Ò·Ó·Ô·Õ·Ö·×·Ø·Ù·Ú·Û·Ü·Ý·Þ·ß·à·á·â·ã·ä·å·æ·ç·è·é·ê·ë·ì·í·î·ï·ð·ñ·ò·ó·ô·õ·ö·÷·ø·ù·ú·û·ü·ý·þ¸¡¸¢¸£¸¤¸¥¸¦¸§¸¨¸©¸ª¸«¸¬¸­¸®¸¯¸°¸±¸²¸³¸´¸µ¸¶¸·¸¸¸¹¸º¸»¸¼¸½¸¾¸¿¸À¸Á¸Â¸Ã¸Ä¸Å¸Æ¸Ç¸È¸É¸Ê¸Ë¸Ì¸Í¸Î¸Ï¸Ð¸Ñ¸Ò¸Ó¸Ô¸Õ¸Ö¸×¸Ø¸Ù¸Ú¸Û¸Ü¸Ý¸Þ¸ß¸à¸á¸â¸ã¸ä¸å¸æ¸ç¸è¸é¸ê¸ë¸ì¸í¸î¸ï¸ð¸ñ¸ò¸ó¸ô¸õ¸ö¸÷¸ø¸ù¸ú¸û¸ü¸ý¸þ¹¡¹¢¹£¹¤¹¥¹¦¹§¹¨¹©¹ª¹«¹¬¹­¹®¹¯¹°¹±¹²¹³¹´¹µ¹¶¹·¹¸¹¹¹º¹»¹¼¹½¹¾¹¿¹À¹Á¹Â¹Ã¹Ä¹Å¹Æ¹Ç¹È¹É¹Ê¹Ë¹Ì¹Í¹Î¹Ï¹Ð¹Ñ¹Ò¹Ó¹Ô¹Õ¹Ö¹×¹Ø¹Ù¹Ú¹Û¹Ü¹Ý¹Þ¹ß¹à¹á¹â¹ã¹ä¹å¹æ¹ç¹è¹é¹ê¹ë¹ì¹í¹î¹ï¹ð¹ñ¹ò¹ó¹ô¹õ¹ö¹÷¹ø¹ù¹ú¹û¹ü¹ý¹þº¡º¢º£º¤º¥º¦º§º¨º©ºªº«º¬º­º®º¯º°º±º²º³º´ºµº¶º·º¸º¹ººº»º¼º½º¾º¿ºÀºÁºÂºÃºÄºÅºÆºÇºÈºÉºÊºËºÌºÍºÎºÏºÐºÑºÒºÓºÔºÕºÖº×ºØºÙºÚºÛºÜºÝºÞºßºàºáºâºãºäºåºæºçºèºéºêºëºìºíºîºïºðºñºòºóºôºõºöº÷ºøºùºúºûºüºýºþ»¡»¢»£»¤»¥»¦»§»¨»©»ª»«»¬»­»®»¯»°»±»²»³»´»µ»¶»·»¸»¹»º»»»¼»½»¾»¿»À»Á»Â»Ã»Ä»Å»Æ»Ç»È»É»Ê»Ë»Ì»Í»Î»Ï»Ð»Ñ»Ò»Ó»Ô»Õ»Ö»×»Ø»Ù»Ú»Û»Ü»Ý»Þ»ß»à»á»â»ã»ä»å»æ»ç»è»é»ê»ë»ì»í»î»ï»ð»ñ»ò»ó»ô»õ»ö»÷»ø»ù»ú»û»ü»ý»þ¼¡¼¢¼£¼¤¼¥¼¦¼§¼¨¼©¼ª¼«¼¬¼­¼®¼¯¼°¼±¼²¼³¼´¼µ¼¶¼·¼¸¼¹¼º¼»¼¼¼½¼¾¼¿¼À¼Á¼Â¼Ã¼Ä¼Å¼Æ¼Ç¼È¼É¼Ê¼Ë¼Ì¼Í¼Î¼Ï¼Ð¼Ñ¼Ò¼Ó¼Ô¼Õ¼Ö¼×¼Ø¼Ù¼Ú¼Û¼Ü¼Ý¼Þ¼ß¼à¼á¼â¼ã¼ä¼å¼æ¼ç¼è¼é¼ê¼ë¼ì¼í¼î¼ï¼ð¼ñ¼ò¼ó¼ô¼õ¼ö¼÷¼ø¼ù¼ú¼û¼ü¼ý¼þ½¡½¢½£½¤½¥½¦½§½¨½©½ª½«½¬½­½®½¯½°½±½²½³½´½µ½¶½·½¸½¹½º½»½¼½½½¾½¿½À½Á½Â½Ã½Ä½Å½Æ½Ç½È½É½Ê½Ë½Ì½Í½Î½Ï½Ð½Ñ½Ò½Ó½Ô½Õ½Ö½×½Ø½Ù½Ú½Û½Ü½Ý½Þ½ß½à½á½â½ã½ä½å½æ½ç½è½é½ê½ë½ì½í½î½ï½ð½ñ½ò½ó½ô½õ½ö½÷½ø½ù½ú½û½ü½ý½þ¾¡¾¢¾£¾¤¾¥¾¦¾§¾¨¾©¾ª¾«¾¬¾­¾®¾¯¾°¾±¾²¾³¾´¾µ¾¶¾·¾¸¾¹¾º¾»¾¼¾½¾¾¾¿¾À¾Á¾Â¾Ã¾Ä¾Å¾Æ¾Ç¾È¾É¾Ê¾Ë¾Ì¾Í¾Î¾Ï¾Ð¾Ñ¾Ò¾Ó¾Ô¾Õ¾Ö¾×¾Ø¾Ù¾Ú¾Û¾Ü¾Ý¾Þ¾ß¾à¾á¾â¾ã¾ä¾å¾æ¾ç¾è¾é¾ê¾ë¾ì¾í¾î¾ï¾ð¾ñ¾ò¾ó¾ô¾õ¾ö¾÷¾ø¾ù¾ú¾û¾ü¾ý¾þ¿¡¿¢¿£¿¤¿¥¿¦¿§¿¨¿©¿ª¿«¿¬¿­¿®¿¯¿°¿±¿²¿³¿´¿µ¿¶¿·¿¸¿¹¿º¿»¿¼¿½¿¾¿¿¿À¿Á¿Â¿Ã¿Ä¿Å¿Æ¿Ç¿È¿É¿Ê¿Ë¿Ì¿Í¿Î¿Ï¿Ð¿Ñ¿Ò¿Ó¿Ô¿Õ¿Ö¿×¿Ø¿Ù¿Ú¿Û¿Ü¿Ý¿Þ¿ß¿à¿á¿â¿ã¿ä¿å¿æ¿ç¿è¿é¿ê¿ë¿ì¿í¿î¿ï¿ð¿ñ¿ò¿ó¿ô¿õ¿ö¿÷¿ø¿ù¿ú¿û¿ü¿ý¿þÀ¡À¢À£À¤À¥À¦À§À¨À©ÀªÀ«À¬À­À®À¯À°À±À²À³À´ÀµÀ¶À·À¸À¹ÀºÀ»À¼À½À¾À¿ÀÀÀÁÀÂÀÃÀÄÀÅÀÆÀÇÀÈÀÉÀÊÀËÀÌÀÍÀÎÀÏÀÐÀÑÀÒÀÓÀÔÀÕÀÖÀ×ÀØÀÙÀÚÀÛÀÜÀÝÀÞÀßÀàÀáÀâÀãÀäÀåÀæÀçÀèÀéÀêÀëÀìÀíÀîÀïÀðÀñÀòÀóÀôÀõÀöÀ÷ÀøÀùÀúÀûÀýÀþÁ¡Á¢Á£Á¤Á¥Á¦Á§Á¨Á©ÁªÁ«Á¬Á­Á®Á¯Á°Á±Á²Á³Á´ÁµÁ¶Á·Á¸Á¹ÁºÁ»Á¼Á½Á¾Á¿ÁÀÁÁÁÂÁÃÁÄÁÅÁÆÁÇÁÈÁÉÁÊÁËÁÌÁÍÁÎÁÏÁÐÁÑÁÒÁÓÁÔÁÕÁÖÁ×ÁØÁÙÁÚÁÛÁÜÁÝÁÞÁßÁàÁáÁâÁãÁäÁåÁæÁçÁèÁéÁêÁëÁìÁíÁîÁïÁðÁñÁòÁóÁôÁõÁöÁ÷ÁøÁùÁúÁûÁüÁýÁþÂ¡Â¢Â£Â¤Â¥Â¦Â§Â¨Â©ÂªÂ«Â¬Â­Â®Â¯Â°Â±Â²Â³Â´ÂµÂ¶Â·Â¸Â¹ÂºÂ»Â¼Â½Â¾Â¿ÂÀÂÁÂÂÂÃÂÄÂÅÂÆÂÇÂÈÂÉÂÊÂËÂÌÂÍÂÎÂÏÂÐÂÑÂÒÂÓÂÔÂÕÂÖÂ×ÂØÂÙÂÚÂÛÂÜÂÝÂÞÂßÂàÂáÂâÂãÂäÂåÂæÂçÂèÂéÂêÂëÂìÂíÂîÂïÂðÂñÂòÂóÂôÂõÂöÂ÷ÂøÂùÂúÂûÂüÂýÂþÃ¡Ã¢Ã£Ã¤Ã¥Ã¦Ã§Ã¨Ã©ÃªÃ«Ã¬Ã­Ã®Ã¯Ã°Ã±Ã²Ã³Ã´ÃµÃ¶Ã·Ã¹ÃºÃ»Ã¼Ã½Ã¾Ã¿ÃÀÃÁÃÂÃÃÃÄÃÅÃÆÃÇÃÈÃÉÃÊÃËÃÌÃÍÃÎÃÏÃÐÃÑÃÒÃÓÃÔÃÕÃÖÃ×ÃØÃÙÃÚÃÛÃÜÃÝÃÞÃßÃàÃáÃâÃãÃäÃåÃæÃçÃèÃéÃêÃëÃìÃíÃîÃïÃðÃñÃòÃóÃôÃõÃöÃ÷ÃøÃùÃúÃûÃüÃýÃþÄ¡Ä¢Ä£Ä¤Ä¥Ä¦Ä§Ä¨Ä©ÄªÄ«Ä¬Ä­Ä®Ä¯Ä°Ä±Ä²Ä³Ä´ÄµÄ¶Ä·Ä¸Ä¹ÄºÄ»Ä¼Ä½Ä¾Ä¿ÄÀÄÁÄÂÄÃÄÄÄÅÄÆÄÇÄÈÄÉÄÊÄËÄÌÄÍÄÎÄÏÄÐÄÑÄÒÄÓÄÔÄÕÄÖÄ×ÄØÄÙÄÚÄÛÄÜÄÝÄÞÄßÄàÄáÄâÄãÄäÄåÄæÄçÄèÄéÄêÄëÄìÄíÄîÄïÄðÄñÄòÄóÄôÄõÄöÄ÷ÄøÄùÄúÄûÄüÄýÄþÅ¡Å¢Å£Å¤Å¥Å¦Å§Å¨Å©ÅªÅ«Å¬Å­Å®Å¯Å°Å±Å²Å³Å´ÅµÅ¶Å·Å¸Å¹ÅºÅ»Å¼Å½Å¾Å¿ÅÀÅÁÅÂÅÃÅÄÅÅÅÆÅÇÅÈÅÉÅÊÅËÅÌÅÍÅÎÅÏÅÐÅÑÅÒÅÓÅÔÅÕÅÖÅ×ÅØÅÙÅÚÅÛÅÜÅÝÅÞÅßÅàÅáÅâÅãÅäÅåÅæÅçÅèÅéÅêÅëÅìÅíÅîÅïÅðÅñÅòÅóÅôÅõÅöÅ÷ÅøÅùÅúÅûÅüÅýÅþÆ¡Æ¢Æ£Æ¤Æ¥Æ¦Æ§Æ¨Æ©ÆªÆ«Æ¬Æ­Æ®Æ¯Æ°Æ±Æ²Æ³Æ´ÆµÆ¶Æ·Æ¸Æ¹ÆºÆ»Æ¼Æ½Æ¾Æ¿ÆÀÆÁÆÂÆÃÆÄÆÅÆÆÆÇÆÈÆÉÆÊÆËÆÌÆÍÆÎÆÏÆÐÆÑÆÒÆÓÆÔÆÕÆÖÆ×ÆØÆÙÆÚÆÛÆÜÆÝÆÞÆßÆàÆáÆâÆãÆäÆåÆæÆçÆèÆéÆêÆëÆìÆíÆîÆïÆðÆñÆòÆóÆôÆõÆöÆ÷ÆøÆùÆúÆûÆüÆýÆþÇ¡Ç¢Ç£Ç¤Ç¦Ç§Ç¨Ç©ÇªÇ«Ç¬Ç­Ç®Ç¯Ç°Ç±Ç²Ç³Ç´ÇµÇ¶Ç·Ç¸Ç¹ÇºÇ»Ç¼Ç½Ç¾Ç¿ÇÀÇÁÇÂÇÃÇÄÇÅÇÆÇÇÇÈÇÉÇÊÇËÇÌÇÍÇÎÇÏÇÐÇÑÇÒÇÓÇÔÇÕÇÖÇ×ÇØÇÙÇÚÇÛÇÜÇÝÇÞÇßÇàÇáÇâÇãÇäÇåÇæÇçÇèÇéÇêÇëÇìÇíÇîÇïÇðÇñÇòÇóÇôÇõÇöÇ÷ÇøÇùÇúÇûÇüÇýÇþÈ¡È¢È£È¤È¥È¦È§È¨È©ÈªÈ«È¬È­È®È¯È°È±È²È³È´ÈµÈ¶È·È¸È¹ÈºÈ»È¼È½È¾È¿ÈÀÈÁÈÂÈÃÈÄÈÅÈÆÈÇÈÈÈÉÈÊÈËÈÌÈÍÈÎÈÏÈÐÈÑÈÒÈÓÈÔÈÕÈÖÈ×ÈØÈÙÈÚÈÛÈÜÈÝÈÞÈßÈàÈáÈâÈãÈäÈåÈæÈçÈèÈéÈêÈëÈìÈíÈîÈïÈðÈñÈòÈóÈôÈõÈöÈ÷ÈøÈùÈúÈûÈüÈþÈýÉ¡É¢É£É¤É¥É¦É§É¨É©ÉªÉ«É¬É­É®É¯É°É±É²É³É´ÉµÉ¶É·É¸É¹ÉºÉ»É¼É½É¾É¿ÉÀÉÁÉÂÉÃÉÄÉÅÉÆÉÇÉÈÉÉÉËÉÌÉÍÉÎÉÏÉÐÉÑÉÒÉÓÉÔÉÕÉÖÉ×ÉØÉÙÉÚÉÛÉÜÉÝÉÞÉßÉàÉáÉâÉãÉäÉåÉæÉçÉèÉéÉêÉëÉìÉíÉîÉïÉðÉñÉòÉóÉôÉõÉöÉ÷ÉøÉùÉúÉûÉüÉýÉþÊ¡Ê¢Ê£Ê¤Ê¥Ê¦Ê§Ê¨Ê©ÊªÊ«Ê¬Ê­Ê®Ê¯Ê°Ê±Ê²Ê³Ê´ÊµÊ¶Ê·Ê¸Ê¹ÊºÊ»Ê¼Ê½Ê¾Ê¿ÊÀÊÁÊÂÊÃÊÄÊÅÊÆÊÇÊÈÊÉÊÊÊËÊÌÊÍÊÎÊÏÊÐÊÑÊÒÊÓÊÔÊÕÊÖÊ×ÊØÊÙÊÚÊÛÊÜÊÝÊÞÊßÊàÊáÊâÊãÊäÊåÊæÊçÊèÊéÊêÊëÊìÊíÊîÊïÊðÊñÊòÊóÊôÊõÊöÊ÷ÊøÊùÊúÊûÊüÊýÊþË¡Ë¢Ë£Ë¤Ë¥Ë¦Ë§Ë¨Ë©ËªË«Ë¬Ë­Ë®Ë¯Ë°Ë±Ë²Ë³Ë´ËµË¶Ë·Ë¸Ë¹ËºË»Ë¼Ë½Ë¾Ë¿ËÀËÁËÂËÃËÄËÅËÆËÇËÈËÉËÊËËËÌËÍËÎËÏËÐËÑËÒËÓËÔËÕËÖË×ËØËÙËÚËÛËÜËÝËÞËßËàËáËâËãËäËåËæËçËèËéËêËëËìËíËîËïËðËñËòËóËôËõËöË÷ËøËùËúËûËüËýËþÌ¡Ì¢Ì£Ì¤Ì¥Ì¦Ì§Ì¨Ì©Ì«Ì¬Ì­Ì®Ì¯Ì°Ì±Ì²Ì³Ì´ÌµÌ¶Ì·Ì¸Ì¹ÌºÌ»Ì¼Ì½Ì¾Ì¿ÌÀÌÁÌÂÌÃÌÄÌÅÌÆÌÇÌÈÌÉÌÊÌËÌÌÌÍÌÎÌÏÌÐÌÑÌÒÌÓÌÔÌÕÌÖÌ×ÌØÌÙÌÚÌÛÌÜÌÝÌÞÌßÌàÌáÌâÌãÌäÌåÌæÌçÌèÌéÌêÌëÌìÌíÌîÌïÌðÌñÌòÌóÌôÌõÌöÌ÷ÌøÌùÌúÌûÌüÌýÌþÍ¡Í¢Í£Í¤Í¥Í¦Í§Í¨Í©ÍªÍ«Í¬Í­Í®Í¯Í°Í±Í²Í³Í´ÍµÍ¶Í·Í¸Í¹ÍºÍ»Í¼Í½Í¾Í¿ÍÀÍÁÍÂÍÃÍÄÍÅÍÆÍÇÍÈÍÉÍÊÍËÍÌÍÍÍÎÍÏÍÐÍÑÍÒÍÓÍÔÍÕÍÖÍ×ÍØÍÙÍÚÍÛÍÜÍÝÍÞÍßÍàÍáÍâÍãÍäÍåÍæÍçÍèÍéÍêÍëÍìÍíÍîÍïÍðÍñÍòÍóÍôÍõÍöÍ÷ÍøÍùÍúÍûÍüÍýÍþÎ¡Î¢Î£Î¤Î¥Î¦Î§Î¨Î©ÎªÎ«Î¬Î­Î®Î¯Î°Î±Î²Î³Î´ÎµÎ¶Î·Î¸Î¹ÎºÎ»Î¼Î½Î¾Î¿ÎÀÎÁÎÂÎÃÎÄÎÅÎÆÎÇÎÈÎÉÎÊÎËÎÌÎÍÎÎÎÏÎÐÎÑÎÒÎÓÎÔÎÕÎÖÎ×ÎØÎÙÎÚÎÛÎÜÎÝÎÞÎßÎàÎáÎâÎãÎäÎåÎæÎçÎèÎéÎêÎëÎìÎíÎîÎïÎðÎñÎòÎóÎôÎõÎöÎ÷ÎøÎùÎúÎûÎüÎýÎþÏ¡Ï¢Ï£Ï¤Ï¥Ï¦Ï§Ï¨Ï©ÏªÏ«Ï¬Ï­Ï®Ï¯Ï°Ï±Ï²Ï³Ï´ÏµÏ¶Ï·Ï¸Ï¹ÏºÏ»Ï¼Ï½Ï¾Ï¿ÏÀÏÁÏÂÏÃÏÄÏÅÏÆÏÈÏÉÏÊÏËÏÌÏÍÏÎÏÏÏÐÏÑÏÒÏÓÏÔÏÕÏÖÏ×ÏØÏÙÏÚÏÛÏÜÏÝÏÞÏßÏàÏáÏâÏãÏäÏåÏæÏçÏèÏéÏêÏëÏìÏíÏîÏïÏðÏñÏòÏóÏôÏõÏöÏ÷ÏøÏùÏúÏûÏüÏýÏþÐ¡Ð¢Ð£Ð¤Ð¥Ð¦Ð§Ð¨Ð©ÐªÐ«Ð¬Ð­Ð®Ð¯Ð°Ð±Ð²Ð³Ð´ÐµÐ¶Ð·Ð¸Ð¹ÐºÐ»Ð¼Ð½Ð¾Ð¿ÐÀÐÁÐÂÐÃÐÄÐÅÐÆÐÇÐÈÐÉÐÊÐËÐÌÐÍÐÎÐÏÐÐÐÑÐÒÐÓÐÔÐÕÐÖÐ×ÐØÐÙÐÚÐÛÐÜÐÝÐÞÐßÐàÐáÐâÐãÐäÐåÐæÐçÐèÐéÐêÐëÐìÐíÐîÐïÐðÐñÐòÐóÐôÐõÐöÐ÷ÐøÐùÐúÐûÐüÐýÐþÑ¡Ñ¢Ñ£Ñ¤Ñ¥Ñ¦Ñ§Ñ¨Ñ©ÑªÑ«Ñ¬Ñ­Ñ®Ñ¯Ñ°Ñ±Ñ²Ñ³Ñ´ÑµÑ¶Ñ·Ñ¸Ñ¹ÑºÑ»Ñ¼Ñ½Ñ¾Ñ¿ÑÀÑÁÑÂÑÃÑÄÑÅÑÆÑÇÑÈÑÉÑÊÑËÑÌÑÍÑÎÑÏÑÐÑÑÑÒÑÓÑÔÑÕÑÖÑ×ÑØÑÙÑÚÑÛÑÜÑÝÑÞÑßÑàÑáÑâÑãÑäÑåÑæÑçÑèÑéÑêÑëÑìÑíÑîÑïÑðÑñÑòÑóÑôÑõÑöÑ÷ÑøÑùÑúÑûÑüÑýÑþÒ¡Ò¢Ò£Ò¤Ò¥Ò¦Ò§Ò¨Ò©ÒªÒ«Ò¬Ò­Ò®Ò¯Ò°Ò±Ò²Ò³Ò´ÒµÒ¶Ò·Ò¸Ò¹ÒºÒ»Ò¼Ò½Ò¾Ò¿ÒÀÒÁÒÂÒÃÒÄÒÅÒÆÒÇÒÈÒÉÒÊÒËÒÌÒÍÒÎÒÏÒÐÒÑÒÒÒÓÒÔÒÕÒÖÒ×ÒØÒÙÒÚÒÛÒÜÒÝÒÞÒßÒàÒáÒâÒãÒäÒåÒæÒçÒèÒéÒêÒëÒìÒíÒîÒïÒðÒñÒòÒóÒôÒõÒöÒ÷ÒøÒùÒúÒûÒüÒýÒþÓ¡Ó¢Ó£Ó¤Ó¥Ó¦Ó§Ó¨Ó©ÓªÓ«Ó¬Ó­Ó®Ó¯Ó°Ó±Ó²Ó³Ó´ÓµÓ¶Ó·Ó¸Ó¹ÓºÓ»Ó¼Ó½Ó¾Ó¿ÓÀÓÁÓÂÓÃÓÄÓÅÓÆÓÇÓÈÓÉÓÊÓËÓÌÓÍÓÎÓÏÓÐÓÑÓÒÓÓÓÔÓÕÓÖÓ×ÓØÓÙÓÚÓÛÓÜÓÝÓÞÓßÓàÓáÓâÓãÓäÓåÓæÓçÓèÓéÓêÓëÓìÓíÓîÓïÓðÓñÓòÓóÓôÓõÓöÓ÷ÓøÓùÓúÓûÓüÓýÓþÔ¡Ô¢Ô£Ô¤Ô¥Ô¦Ô§Ô¨Ô©ÔªÔ«Ô¬Ô­Ô®Ô¯Ô°Ô±Ô²Ô³Ô´ÔµÔ¶Ô·Ô¸Ô¹ÔºÔ»Ô¼Ô½Ô¾Ô¿ÔÀÔÁÔÂÔÃÔÄÔÅÔÆÔÇÔÈÔÉÔÊÔËÔÌÔÍÔÎÔÏÔÐÔÑÔÒÔÓÔÔÔÕÔÖÔ×ÔØÔÙÔÚÔÛÔÜÔÝÔÞÔßÔàÔáÔâÔãÔäÔåÔæÔçÔèÔéÔêÔëÔìÔíÔîÔïÔðÔñÔòÔóÔôÔõÔöÔ÷ÔøÔùÔúÔûÔüÔýÔþÕ¡Õ¢Õ£Õ¤Õ¥Õ¦Õ§Õ¨Õ©ÕªÕ«Õ¬Õ­Õ®Õ¯Õ°Õ±Õ²Õ³Õ´ÕµÕ¶Õ·Õ¸Õ¹ÕºÕ»Õ¼Õ½Õ¾Õ¿ÕÀÕÁÕÂÕÃÕÄÕÅÕÆÕÇÕÈÕÉÕÊÕËÕÌÕÍÕÎÕÏÕÐÕÑÕÒÕÓÕÔÕÕÕÖÕ×ÕØÕÙÕÚÕÛÕÜÕÝÕÞÕßÕàÕáÕâÕãÕäÕåÕæÕçÕèÕéÕêÕëÕìÕíÕîÕïÕðÕñÕòÕóÕôÕõÕöÕ÷ÕøÕùÕúÕûÕüÕýÕþÖ¡Ö¢Ö£Ö¤Ö¥Ö¦Ö§Ö¨Ö©ÖªÖ«Ö¬Ö­Ö®Ö¯Ö°Ö±Ö²Ö³Ö´ÖµÖ¶Ö·Ö¸Ö¹ÖºÖ»Ö¼Ö½Ö¾Ö¿ÖÀÖÁÖÂÖÃÖÄÖÅÖÆÖÇÖÈÖÉÖÊÖËÖÌÖÍÖÎÖÏÖÐÖÑÖÒÖÓÖÔÖÕÖÖÖ×ÖØÖÙÖÚÖÛÖÜÖÝÖÞÖßÖàÖáÖâÖãÖäÖåÖæÖçÖèÖéÖêÖëÖìÖíÖîÖïÖðÖñÖòÖóÖôÖõÖöÖ÷ÖøÖùÖúÖûÖüÖýÖþ×¡×¢×£×¤×¥×¦×§×¨×©×ª×«×¬×­×®×¯×°×±×²×³×´×µ×¶×·×¸×¹×º×»×¼×½×¾×¿×À×Á×Â×Ã×Ä×Å×Æ×Ç×È×É×Ê×Ë×Ì×Í×Î×Ï×Ð×Ñ×Ò×Ó×Ô×Õ×Ö×××Ø×Ù×Ú×Û×Ü×Ý×Þ×ß×à×á×â×ã×ä×å×æ×ç×è×é×ê×ë×ì×í×î×ï×ð×ñ×ò×ó×ô×õ×ö×÷×ø×ùØ¡Ø¢Ø£Ø¤Ø¥Ø¦Ø§Ø¨Ø©ØªØ«Ø¬Ø®Ø°Ø±Ø²Ø³Ø´ØµØ¶Ø·Ø¸Ø¹ØºØ½Ø¾Ø¿ØÀØÁØÂØÃØÄØÅØÆØÇØÈØÉØÊØÌØÍØÎØÏØÐØÑØÒØÓØÔØÕØ×ØØØÙØÚØÛØÜØÝØÞØßØàØáØâØãØäØæØèØêØëØìØíØîØðØñØòØóØôØõØöØ÷ØøØùØúØûØüØýØþÙ¡Ù¢Ù¤Ù¥Ù¦Ù§Ù¨Ù©ÙªÙ«Ù¬Ù­Ù®Ù¯Ù°Ù±Ù²Ù³Ù´ÙµÙ¶Ù·Ù¸Ù¹ÙºÙ»Ù¼Ù½Ù¾Ù¿ÙÁÙÂÙÃÙÄÙÅÙÆÙÇÙÈÙÉÙÊÙËÙÌÙÍÙÎÙÏÙÐÙÑÙÒÙÓÙÔÙÕÙÖÙ×ÙØÙÙÙÚÙÛÙÜÙÝÙÞÙßÙáÙâÙãÙäÙåÙæÙçÙéÙêÙëÙìÙíÙîÙðÙñÙòÙóÙôÙõÙöÙ÷ÙøÙùÙúÙüÙýÙþÚ£Ú¤Ú¦Ú§Ú¨Ú©ÚªÚ«Ú¬Ú­Ú®Ú¯Ú±Ú²Ú³Ú´ÚµÚ¶Ú·Ú¸Ú¹ÚºÚ»Ú¼Ú½Ú¾Ú¿ÚÀÚÁÚÂÚÃÚÄÚÅÚÆÚÇÚÈÚÉÚÊÚËÚÌÚÍÚÎÚÏÚÐÚÑÚÒÚÓÚÔÚÕÚÖÚ×ÚØÚÙÚÚÚÛÚÜÚÝÚÞÚßÚáÚãÚäÚåÚæÚçÚèÚéÚêÚëÚìÚíÚîÚïÚðÚñÚòÚóÚôÚõÚöÚ÷ÚøÚùÚúÚûÚüÚýÚþÛ¡Û¢Û£Û¤Û¥Û¦Û¨Û©ÛªÛ«Û¬Û­Û®Û¯Û°Û±Û²Û³Û´ÛµÛ¶Û·Û¸Û¹ÛºÛ»Û¼Û½Û¾Û¿ÛÀÛÁÛÃÛÄÛÅÛÆÛÇÛËÛÍÛÎÛÏÛÐÛÑÛÓÛÔÛÕÛÖÛ×ÛØÛÚÛÛÛÜÛÝÛÞÛßÛáÛãÛäÛåÛæÛçÛèÛéÛêÛëÛìÛíÛîÛïÛòÛóÛôÛõÛöÛ÷ÛøÛùÛúÛüÛýÜ¡Ü¢Ü£Ü¤Ü¥Ü¦Ü§Ü©ÜªÜ¬Ü­Ü¯Ü°Ü±Ü²Ü´ÜµÜ¶Ü·Ü¸Ü¹ÜºÜ»Ü¼Ü½Ü¾Ü¿ÜÀÜÁÜÂÜÄÜÅÜÆÜÇÜÈÜÉÜÊÜËÜÌÜÍÜÏÜÑÜÒÜÓÜÔÜÖÜ×ÜØÜÙÜÚÜÛÜÝÜÞÜßÜàÜâÜãÜäÜåÜæÜçÜèÜéÜêÜëÜìÜíÜîÜïÜðÜñÜòÜóÜôÜõÜöÜ÷ÜøÜùÜúÜûÜüÜýÜþÝ¢Ý£Ý¥Ý¦Ý©ÝªÝ«Ý¬Ý­Ý®Ý°Ý±Ý³Ý´ÝµÝ¶Ý·Ý¸Ý¹ÝºÝ¼Ý½Ý¾Ý¿ÝÀÝÂÝÃÝÄÝÅÝÇÝÈÝÉÝÊÝËÝÌÝÍÝÎÝÏÝÐÝÑÝÒÝÓÝÔÝÕÝ×ÝØÝÙÝÚÝÛÝÝÝÞÝßÝàÝáÝâÝãÝäÝåÝæÝçÝèÝéÝêÝëÝíÝîÝïÝðÝñÝòÝóÝôÝõÝ÷ÝøÝùÝûÝüÝýÝþÞ¡Þ¢Þ£Þ¤Þ¥Þ¦Þ§Þ¨Þ©ÞªÞ«Þ¬Þ­Þ®Þ¯Þ°Þ±Þ²Þ³Þ´ÞµÞ¶Þ·Þ¸Þ¹ÞºÞ¼Þ½Þ¾Þ¿ÞÀÞÂÞÃÞÄÞÅÞÆÞÇÞÈÞÉÞÊÞËÞÌÞÍÞÎÞÏÞÑÞÒÞÓÞÔÞÕÞÖÞ×ÞØÞÙÞÚÞÛÞÜÞÝÞÞÞßÞàÞáÞâÞãÞäÞåÞæÞçÞèÞéÞëÞìÞíÞïÞðÞñÞòÞóÞôÞõÞöÞ÷ÞøÞùÞúÞûÞüÞýÞþß¡ß¢ß£ß¤ß¥ß§ß¨ß©ßªß«ß¬ß­ß®ß¯ß±ß³ß´ßµß¶ß·ß¸ßºß¼ß½ß¾ß¿ßÀßÂßÆßÈßÉßÊßËßÌßÍßÎßÏßÒßÓßÕßÖß×ßØßÙßÚßÜßÝßÞßàßâßãßäßæßçßèßéßêßëßìßíßîßïßñßòßóßôßõßöß÷ßùßúßûßýà¡à¢à£à¤à¦à§à¨à©àªà«à¬à®à¯à°à±à²à³à´àµà¶à·à¸à¹à»à¼à½à¾à¿àÁàÂàÃàÄàÅàÆàÇàÈàÉàÊàËàÍàÎàÐàÑàÒàÓàÕàÖà×àÙàÚàÛàÜàÞàßàààáàãàäàåàæàéàêàìàîàïàðàñàòàóàôàõàöà÷àøàùàúàûàüàýàþá¡á¢á£á¤á¦á§á¨á©áªá«á¬á­á¯á°á²á³áµá¶á·á¸áºá»á¼á½á¾á¿áÀáÁáÂáÃáÄáÅáÆáÇáÈáÉáËáÌáÍáÎáÏáÐáÑáÒáÓáÔáÖá×áØáÙáÚáÛáÜáÝáÞáßáàáâáãáäáåáæáçáèáéáìáíáîáðáñáòáôáõáöá÷áøáùáúáûáüáýáþâ¡â¢â£â¤â¥â¦â§â¨â©â«â®â¯â°â±â²â³â´âµâ¶â·â¸â¹â¼â½â¾â¿âÀâÁâÂâÃâÄâÅâÆâÈâÉâÊâËâÍâÏâÐâÑâÒâÓâÔâÕâÖâ×âØâÙâÚâÛâÜâÝâÞâßâáâââãâäâåâæâçâèâéâêâëâìâíâîâïâðâñâòâóâôâõâöâ÷âøâùâúâûâüâýâþã¡ã¢ã£ã¤ã¥ã¦ã§ã¨ã©ãªã«ã¬ã­ã®ã¯ã°ã±ã²ã³ã´ãµã¶ã·ã¸ã¹ãºã»ã¼ã½ã¾ã¿ãÁãÂãÃãÄãÅãÆãÇãÈãÉãÊãËãÌãÍãÎãÏãÐãÑãÓãÔãÕãÖã×ãØãÙãÚãÛãÞãàãáãâãããäãåãæãçãèãêãëãìãíãîãïãðãñãòãóãôãöã÷ãøãùãúãûãüãýãþä¡ä¢ä£ä¤ä¥ä¦ä§ä¨ä©äªä«ä¬ä­ä®ä¯ä°ä±ä²ä³ä´äµä¶ä·ä¸ä¹ä»ä¼ä½ä¾ä¿äÀäÁäÂäÃäÄäÅäÆäÇäÈäÉäÊäËäÌäÍäÎäÏäÐäÑäÒäÓäÔäÕäÖä×äØäÙäÚäÛäÜäÝäÞäßäàäáäãäääåäæäçäèäéäêäëäìäîäïäðäñäòäóäôäõäöä÷äøäùäúäûäüäýäþå¡å¢å£å¤å¥å¦å§å©åªå«å¬å­å®å¯å°å±å³å´åµå¶å·å¸å¹åºå»å¼å½å¾å¿åÀåÂåÃåÄåÅåÆåÇåÈåÉåÊåËåÌåÍåÎåÏåÐåÑåÒåÓåÔåÕåÖå×åØåÙåÚåÛåÜåÝåÞåßåàåáåâåãåäåååçåèåéåêåëåìåíåîåïåðåñåòåóåôåõåöå÷åùåúåûåüåýåþæ¡æ¢æ£æ¤æ¥æ¦æ§æ¨æ©æªæ«æ¬æ­æ®æ¯æ°æ²æ³æ´æµæ¶æ·æ¸æ¹æºæ»æ¼æ½æ¾æ¿æÁæÂæÃæÄæÅæÆæÇæÈæÉæÊæËæÌæÍæÎæÏæÐæÑæÒæÓæÔæÕæÖæ×æØæÚæÛæÜæÝæÞæßæàæáæâæãæäæåæææçæèæéæêæëæìæíæîæïæðæñæòæóæôæõæöæ÷æøæúæûæüæýæþç¡ç¢ç£ç¤ç¥ç¦ç§ç¨ç©ç¬ç­ç®ç¯ç°ç±ç²ç³çµç¶ç·ç¸ç¹çºç»ç¼ç½ç¾ç¿çÀçÁçÂçÃçÄçÅçÆçÇçÈçÉçÊçËçÌçÍçÎçÏçÐçÑçÒçÓçÔçÕç×çØçÙçÚçÜçÞçßçàçáçâçãçäçåçæçççèçéçêçìçíçîçïçðçñçòçóçôçõçöç÷çøçùçúçûçüçýçþè¡è¢è£è¤è¥è¦è§è¨è©èªè«è¬è­è®è¯è°è±è²è³è´èµè¶è·è¸è¹èºè»è¼è½è¾è¿èÀèÁèÂèÃèÄèÆèÇèÈèÉèÊèËèÌèÍèÎèÏèÐèÑèÒèÓèÔèÕèÖè×èØèÙèÚèÛèÜèÝèÞèßèàèáèâèãèäèåèæèçèèèéèëèìèíèîèïèñèòèóèôèõèöè÷èøèùèúèûèüèýèþé¡é¢é£é¤é¥é¦é§é¨é©éªé«é¬é­é®é±é²é³é´éµé¶é·é¸é¹éºé»é¼é½é¾é¿éÀéÁéÂéÃéÄéÅéÆéÇéÈéÉéÊéËéÌéÍéÎéÏéÐéÑéÒéÓéÔéÕéÖé×éØéÙéÚéÛéÜéÝéÞéàéâéãéäéåéæéçéèéééêéëéìéíéîéðéñéòéóéôéöé÷éøéùéúéûéüéýéþê¡ê¢ê£ê¤ê¥ê§ê¨ê©êªê«ê¬ê­ê®ê¯ê°ê±ê²ê³ê´êµê¶ê¸ê¹êºê»ê¼ê½ê¾ê¿êÀêÁêÂêÃêÄêÅêÆêÇêÈêÉêÊêËêÌêÍêÎêÐêÑêÒêÓêÔêÕêÖê×êØêÙêÚêÛêÜêÝêÞêßêàêáêâêãêäêæêçêèêéêêêëêìêíêîêïêðêòêôêõêöê÷êøêùêûêüêýêþë¡ë¢ë£ë¥ë¦ë§ë¨ë©ëªë«ë¬ë­ë®ë¯ë°ë±ë²ë³ë´ëµë·ë¹ëºë»ë¼ë½ë¾ëÀëÁëÃëÅëÆëÇëÈëÊëÍëÎëÏëÐëÑëÒëÓëÔëÕëÖë×ëØëÙëÚëÝëÞëàëáëâëãëäëçëèëéëìëíëîëðëóëôëõëöë÷ëøëùëûëüëýëþì¢ì£ì¤ì¥ì¦ì§ì¨ì©ìªì«ì¬ì­ì°ì±ì²ì³ì´ìµì¶ì·ì¸ì¹ìºì»ì¼ì½ì¾ì¿ìÀìÄìÅìÆìÇìÈìÉìÊìËìÌìÍìÏìÐìÒìÔì×ìØìÙìÚìÛìÜìÝìÞìßìàìâìãìäìåìæìçìèìéìëìììíìîìïìðìñìòìóìôìõìöì÷ìøìùìúìûìüìýìþí¡í¢í£í¤í¥í¦í§í¨í©íªí«í¬í­í®í¯í°í²í³í´íµí¶í·í¸í¹íºí¼í½í¾íÀíÂíÃíÄíÆíÇíÈíÉíÊíËíÌíÍíÎíÏíÑíÓíÔíÕíÖí×íØíÙíÚíÜíÝíßíàíáíâíãíäíåíæíçíèíéíêíëíìíííïíðíñíòíóíôíõí÷íøíùíúíûíýíþî¡î¢î£î¤î¥î¦î§î¨î©îªî«î¬î­î®î¯î°î±î²î³î´îµî·î¸î¹îºî»î¼î¾î¿îÀîÁîÂîÃîÅîÆîÇîÈîÉîÊîËîÌîÍîÎîÏîÑîÒîÓîÔîÕîÖî×îØîÙîÚîÛîÜîÝîßîàîáîâîãîäîåîæîçîèîéîêîëîìîíîîîïîðîñîòîóîõî÷îøîùîúîûîüîýîþï¡ï¢ï£ï¤ï¥ï¦ï§ï¨ï©ïªï«ï¬ï®ï¯ï°ï±ï²ï¶ï·ï¸ï¹ïºï¼ï¾ï¿ïÀïÃïÄïÅïÆïÇïÈïÉïÊïËïÌïÎïÏïÒïÓïÔïÖï×ïØïÙïÚïÛïÜïÝïÞïßïàïáïâïäïæïçïèïêïëïìïíïîïðïñïòïóïôïõïöï÷ïøïúïûïüïýïþð¡ð¢ð£ð¤ð¥ð¦ð§ð¨ð©ðªð«ð¬ð­ð®ð¯ð°ð±ð²ð³ð´ðµð¶ð·ð¸ð¹ðºð»ð¼ð½ð¾ð¿ðÀðÁðÂðÃðÄðÆðÇðÈðÉðÊðÎðÏðÐðÑðÒðÓðÔðÕðÖðØðÙðÛðÜðÝðÞðàðáðãðæðèðêðëðìðíðîðïðððñðòðóðôðõðöð÷ðøðùðúðûðýðþñ¢ñ£ñ¤ñ¦ñ§ñ¨ñ©ñªñ«ñ¬ñ®ñ°ñ±ñ²ñ´ñµñ¶ñ·ñ¸ñ¹ñºñ»ñ¼ñ½ñ¾ñ¿ñÀñÁñÃñÄñÅñÆñÇñÈñÉñÊñËñÌñÍñÎñÏñÐñÑñÒñÓñÔñÕñÖñ×ñØñÙñÚñÛñÜñÝñÞñßñàñáñâñãñäñåñæñçñèñéñêñîñïñðñññóñôñõñöñ÷ñøñùñúñûñüñýñþò¡ò¢ò¤ò¥ò¦ò§ò¨ò©òªò«ò­ò¯ò°ò±ò²ò³ò´òµò¶ò·ò¸ò¹òºò»ò¼ò½ò¾ò¿òÀòÁòÂòÃòÄòÅòÆòÇòÈòÉòÊòËòÌòÍòÎòÏòÐòÑòÒòÓòÔòÕòÖò×òØòÙòÚòÛòÜòÝòÞòßòàòáòâòãòäòåòæòçòèòéòêòëòìòîòïòðòòòóòõòöò÷òøòùòúòûòüòþó¡ó¢ó£ó¤ó¥ó¦ó§ó¨ó©óªó«ó¬ó­ó®ó¯ó°ó±ó²ó³ó´ó¶ó·ó¸ó¹óºó»ó¼ó½ó¾ó¿óÀóÁóÂóÃóÄóÅóÆóÇóÈóÉóÊóËóÌóÍóÎóÏóÐóÑóÒóÓóÔóÕóÖó×óØóÙóÚóÛóÜóÝóÞóßóâóãóäóåóæóçóèóéóêóëóìóíóïóðóñóòóóóôóõóöó÷óøóùóúóüóýóþô¡ô¢ô£ô¤ô¥ô¦ô§ô¨ô©ôªô«ô¬ô­ô®ô¯ô±ô²ô³ô´ôµô¶ô·ô¹ôºô»ô¼ô½ô¾ô¿ôÀôÁôÂôÃôÄôÅôÆôÇôÈôÉôÊôËôÍôÎôÑôÒôÓôÔôÕôÖôØôÚôÛôÜôÝôÞôßôàôáôâôãôäôåôæôçôèôéôêôëôìôíôîôïôðôñôòôóôôôõôöô÷ôøôùôúôûôüôýôþõ¡õ¢õ¤õ¥õ¦õ§õ¨õ©õªõ¬õ­õ®õ¯õ°õ±õ²õ³õ´õµõ¶õ·õ¸õ¹õºõ»õ¼õ½õ¾õ¿õÀõÁõÂõÃõÄõÅõÆõÇõÈõÉõÊõËõÌõÍõÎõÏõÐõÑõÒõÓõÔõÕõÖõ×õØõÙõÚõÛõÜõÞõàõáõâõãõäõåõæõçõèõéõêõëõìõíõîõïõðõñõòõóõôõõõöõ÷õøõùõúõûõüõýõþö¡ö¢ö£ö¤ö¥ö¦ö§ö¨ö©öªö«ö¬ö­ö®ö¯ö°ö±ö²ö³ö´öµö¶ö·ö¸ö¹öºö»ö¼ö½ö¾ö¿öÀöÁöÂöÃöÄöÅöÆöÇöÈöÉöÊöËöÌöÎöÏöÐöÑöÔöÕöÖö×öØöÚöÛöÜöÝöÞößöàöáöâöãöäöåöæöçöèöéöêöëöìöíöîöïöðöòöóöôöööøöùöúöûöü÷¡÷¢÷£÷¤÷¥÷¦÷§÷¨÷©÷¬÷­÷®÷¯÷°÷±÷²÷´÷µ÷¶÷·÷º÷»÷¼÷½÷À÷Á÷Â÷Ã÷Ä÷Å÷Æ÷Ç÷È÷É÷Ê÷Ë÷Ì÷Í÷Î÷Ï÷Ð÷Ñ÷Ò÷Ó÷Ô÷Õ÷Ö÷×÷Ø÷Ù÷Ú÷Û÷Ü÷Þ÷ß÷à÷á÷â÷ã÷ä÷å÷æ÷ç÷è÷é÷ê÷ë÷ì÷í÷î÷ï÷ð÷ò÷ó÷ô÷õ÷ö÷÷÷ø÷ù÷ú÷û÷ü÷ý";
    }
    
	static public String turnCompl(){
        return "°¡°¢°£°¤°¥°¦°§°}°©Ì@°«°¬µKÛ°¯°°°±°²°³°´°µ°¶°·°¸óa°º°»°¼°½°¾°¿Ò\°ÁŠW°Ã°Ä°Å°Æ°Ç°È°É°Ê°Ë°Ì°Í°Î°Ï°Ð°Ñ°Ò‰Î°ÔÁT°Ö°×°Ø°Ù”[°Û”¡°Ý°Þ°ß°à°á°â°ãîC°å°æ°ç°è°é°ê°ëÞk½O°îŽÍ°ð°ñ°ò½‰°ô°õ°öæ^°øÖr°ú°û°ü°ý„ƒ±¡±¢±£±¤ï–Œš±§ˆó±©±ªõU±¬±­±®±¯±°±±Ý…±³Øä^±¶ªN‚ä‘v±º±»±¼±½±¾±¿±À¿‡±Â±Ã±Ä±Å±Æ±Ç±È±É¹P±Ë±Ì±Í±Î®…”À±ÑŽÅ±Ó¯wé]±Ö±×±Ø±Ù±Ú±Û±Ü±Ý±Þß…¾ŽÙH±â±ã×ƒ±å±æÞqÞp±é˜Ë±ë±ì±í÷M±ï„e°T±ò±óžlžIÙe”P±ø±ù±ú±û±üïž±þ²¡K²£²¤²¥“ÜÀ²¨²©²ª²«ãK²­²®²¯²°²±²²²³²´ñg²¶²·²¸Ña²º²»²¼²½²¾²¿²À²Á²Â²Ã²Ä²ÅØ”²Ç²È’ñ²Ê²Ë²Ì²Í…¢ÐQšˆ‘M‘K NÉnÅ“‚}œæ²Ø²Ù²Ú²Û²Ü²ÝŽú²ß‚ÈƒÔœyŒÓ²ä²å²æ²ç²è²é²ê²ë²ì²í²îÔŒ²ð²ñ²ò”v“½Ïsð’×‹ÀpçP®aêUî²ý²þˆö‡L³£éLƒ”ÄcS³¨•³³ª³«³¬³­ân³¯³°³±³²³³³´Ü‡³¶³·³¸Ø³º³»³¼³½‰m³¿³À³Áê³ÃÒr“Î·Q³Ç³È³É³Ê³Ë³Ì‘Í³ÎÕ\³Ð³ÑòG³Ó³Ô³Õ³Ö³×³Øßt³ÚñYuýX³Þ³ß³à³á³âŸë³ä›_³æ³çŒ™³é³ê® ÜP³í³î»I³ð¾I³ò³ó³ô³õ³ö™»N³ùäzër³ü³ý³þµAƒ¦´£´¤Ó|ÌŽ´§´¨´©´ª‚÷´¬´­´®¯´°´±´²êJ„“´µ´¶´·åN´¹´º´»´¼´½´¾¼ƒ´À´Á¾b´Ã´Ä´Å´ÆÞo´È´ÉÔ~´Ë´ÌÙn´ÎÂ”Ê[‡è´ÒÄ…²œ´Ö´×´Ø´ÙÜf´Û¸Z´Ý´Þ´ß´à´á´â´ã´ä´å´æ´ç´è´é´ê´ë´ìåe´îß_´ð´ñ´ò´ó´ô´õ´ö´÷Ž§´ù´úÙJ´ü´ý´þµ¡µ¢“úµ¤†Îà“ÛÄ‘µ©µªµ«‘„µ­ÕQ—µ°®”“õühÊŽ™nµ¶“vµ¸µ¹u¶\Œ§µ½µ¾µ¿µÀ±IµÂµÃµÄµÅŸôµÇµÈµÉµÊà‡µÌµÍµÎµÏ”³µÑµÒœìµÔµÕµÖµ×µØµÙµÚµÛµÜßf¾†îµàµáµâücµäµå‰|ëŠµèµéµêµëµìÕµîµïµðµñµòµóµôµõážÕ{µøµùµúµûµüÕ™¯B¶¡¶¢¶£á”í”¶¦åV¶¨Ó†G–|¶¬¶­¶®„Ó—¶±¶²ƒö¶´¶µ¶¶¶·¶¸¶¹¶º¶»¶¼¶½¶¾ Ùªš×x¶Â¶ÃÙ€¶Ååƒ¶Ç¶È¶É¶Ê¶Ë¶Ìå‘¶Î”à¾„¶Ñƒ¶ê Œ¦¶Õ‡¶×¶ØîD¶Úâg¶Ü¶Ý¶Þ¶ß¶àŠZ¶â¶ã¶ä¶å¶æ¶ç¶è‰™¶ê¶ëùZ¶íî~Óž¶ðº¶ò¶ó¶ô¶õðI¶÷¶øƒº¶ú –ðD¶ý¶þÙE°lÁP·¤·¥·¦éy·¨¬m·ª·«·¬·­·®µ\âC·±·²Ÿ©·´·µ·¶Øœ·¸ïˆ·º·»·¼·½·¾·¿·À·Á·ÂÔL¼·Å·Æ·Ç·Èïw·Ê·ËÕu·Í·ÎU·ÐÙM·Ò·Ó·Ô·Õ·Ö¼Š‰ž·Ù·Ú·ÛŠ^·Ý·Þ‘¼SØS·â—÷·ä·åähïL¯‚·é·êñT¿pÖS·îøP·ð·ñ·ò·óÄw·õ·ö·÷Ý—·ù·ú·û·ü·ý·þ¸¡¸¢¸£¸¤¸¥¸¦“áÝo¸©¸ª¸«¸¬¸­¸®¸¯¸°¸±¸²ÙxÍ¸µ¸¶¸·¸¸¸¹Ø“¸»Ó‡¸½‹D¿`¸À¸Á¸ÂÔ“¸Ä¸Åâ}Éw¸È¸É¸Ê¸Ë¸Ì¸Í¸ÎÚs¸Ð¶’¸ÒÚMŒù„‚ä“¸×¸Ø¾V¸Û¸Ü¸Ý¸Þ¸ß¸à¸á¸â¸ãæ€¸å¸æ¸ç¸è”R¸êø¸ì¸í¸î¸ï¸ð¸ñ¸òéw¸ôãt‚€¸÷½o¸ù¸ú¸û¸ü¸ý¸þ¹¡¹¢¹£¹¤¹¥¹¦¹§ý¹©¹ª¹«Œm¹­ì–¹¯¹°Ø•¹²ã^¹´œÏ¹¶¹·¹¸˜‹Ù‰ò¹¼¹½¹¾¹¿¹À¹Á¹Â¹Ã¹Ä¹ÅÐM¹Ç¹È¹É¹Êî™¹Ì¹Í¹Î¹Ï„Ž¹Ñ¹Ò¹Ó¹Ô¹Õ¹Ö¹×êP¹Ù¹ÚÓ^¹Üð^¹Þ‘T¹àØž¹âV¹ä¹åÒŽ¹ç¹èšwý”é|Ü‰¹íÔŽ¹ï¹ð™™¹òÙF„£ÝL¹÷å¹ù‡ø¹û¹üß^¹þº¡º¢º£º¤º¥º¦ñ”º¨º©ºªínº¬º­º®º¯º°º±º²º³º´ºµº¶º·º¸º¹hº»º¼º½º¾º¿ºÀºÁºÂºÃºÄÌ–ºÆºÇºÈºÉºÊºËºÌºÍºÎºÏºÐºÑéuºÓºÔºÕºÖúQÙRºÙºÚºÛºÜºÝºÞºßºà™MºâaÞZºåºæºçø™ºéºêºë¼tºíºîºïºðºñºòááºôºõºöº÷‰Øºùºúºûºüºýºþ»¡»¢»£×o»¥œû‘ô»¨‡WÈA»«»¬®‹„»¯Ô’»±»²‘Ñ»´‰Äšg­h»¸ß€¾“Q»¼†¾¯ˆ»¿Ÿ¨œo»Â»Ã»Ä»ÅüS»Ç»È»É»Ê»Ë»Ì»Í»Î»Ï»ÐÖe»Ò“]Ýx»Õ»Ö»×»Øš§»Ú»Û»Ü»Ý»ÞÙV·x•þ Z…RÖMÕdÀLÈ»è»é»êœ†»ì»í»î»ï»ð«@»ò»ó»ôØ›µœ“ô»ø»ù™C»û»ü·e»þ¼¡ï|ÛE¼¤×Iëu¼§¿ƒ¾ƒ¼ª˜O¼¬Ý‹¼®¼¯¼°¼±¼²¼³¼´¼µ¼‰”DŽ×¼¹¼ºËE¼¼¼½¼¾¼¿¼À„©¼Âú¼Ä¼ÅÓ‹Ó›¼È¼ÉëH¼ËÀ^¼o¼Î¼ÏŠA¼Ñ¼Ò¼ÓÇvîaÙZ¼×â›¼Ù¼Úƒr¼Üñ{¼Þšž±OˆÔ¼â¹{ég¼å¼æ¼çÆD¼é¾}ÀO™z¼íû|û|’þ“ìº†ƒ€¼ôœpË]™‘èbÛ`ÙvÒŠæI¼ý¼þ½¡Åž„¦ðTužR¾½¨½©½ªŒ¢{½­½®ÊY˜ªª„Öv½³áu½µ½¶½·½¸½¹Äz½»½¼²òœ‹É½À”‡ãq³CƒeÄ_½Æ½ÇïœÀU½g½Ë½Ì½ÍÞIÝ^½Ð½Ñ½Ò½Ó½Ô½Õ½ÖëA½Ø½Ù¹½Û½Ü½Ý½Þ½ß½Y½â½ã½ä½å½æ½ç½è½é½êÕ]ŒÃ½í½î½ï½ð½ñ½ò½ó¾oå\ƒHÖ”ßM½ù•x½û½ü a½þ±M„ÅÇG¾¤Ço¾¦¾§öL¾©ó@¾«¾¬½›¾®¾¯¾°îiìo¾³¾´çR½¯d¾¸¾¹¸‚œQ¾¼¾½¾¾¾¿¼m¾Á¾Â¾Ã¾Ä¾Å¾ÆŽý¾ÈÅf¾Ê¾Ë¾Ì¾Í¾Î¾Ï¾Ð¾Ñ¾Ò¾Óñx¾Õ¾Ö¾×¾ØÅe¾Ú¾Û¾Ü“þ¾Þ¾ß¾à¾áä¾ã¾ä‘Ö¾æ„¡¾èùN¾ê¾ë¾ì¾í½¾ï¾ð¾ñ¾ò¾ó¾ôÓX›QÔE½^¾ù¾úâxÜŠ¾ý¾þ¿¡¿¢¿£¿¤òE¿¦¿§¿¨¿©é_¿«¿¬„P¿®¿¯¿°¿±¿²¿³¿´¿µ¿¶¿·¿¸¿¹¿º¿»¿¼¿½¿¾¿¿¿À¿Á¿Â¿Ã¿Äîw¿Æš¤¿È¿É¿Ê¿Ë¿Ì¿ÍÕn¿Ï¿Ð‰¨‘©¿Ó¿Ô¿Õ¿Ö¿×¿Ø“¸¿Ú¿Û¿Ü¿Ý¿Þ¿ß¿à¿áŽìÑ¿ä¿å¿æ¿ç¿è‰K¿êƒ~¿ìŒ’¿î¿ï¿ð¿ñ¿òµV¿ô•ç›rÌ¿øŽh¸Q¿û¿ü¿ý¿þðÀ¢¢À¤À¥À¦À§À¨”UÀªéŸÀ¬À­À®ÏžÅDÀ±À²ÈRíÙ‡Ë{À·™Ú”r»@ê@Ìmž‘×Ž”ˆÓ[‘ÐÀ| €žEÀÅÀÆÀÇÀÈÀÉÀÊÀË“Æ„ÚÀÎÀÏÀÐÀÑÀÒÀÓ³ÀÕ˜·À×èDÀÙÀÚÀÛÀÜ‰¾ÀÞÀßîœIÀâÀãÀäÀåÀæÀçÀè»hÀêëxÀìÀíÀîÑeõŽ¶YÀòÀóÀôÀõû…–„îµ[švÀûÀýÀþÁ¡Á¢Á£žrë`Á¦Á§Á¨‚zÂ“ÉßBç Á®‘ziÁ±”¿Ä˜æœ‘ÙŸ’¾š¼Z›öÁºÁ»Á¼ƒÉÝvÁ¿ÁÀÁÁÕÁÃÁÄÁÅ¯ŸÁÇÁÈß|ÁÊÁËÁÌç‚ÁÎÁÏÁÐÁÑÁÒÁÓ«CÁÕÁÖÁ×ÁØÅRà÷[ÁÜ„CÙUÁßÁàÁáÁâÁãýgâÁæÁçÁèì`ÁêŽXîIÁíÁîÁïÁðÁñÁòðsÁô„¢ÁöÁ÷ÁøÁùýˆÃ@‡µ»\ÁþÂ¡‰Å”në]˜ÇŠä“§ºtÂ©ÂªÌJ±RïB] t“ïûuÌ”ô”Â´ÂµÂ¶Â·ÙTÂ¹Âºµ“ä›ê‘Â¾óH…ÎäX‚HÂÃÂÄŒÒ¿|‘]ÂÈÂÉÂÊžV¾GŽn”Œ\ž´ÂÑyÂÓÂÔ’àÝ†‚öœS¾]Õ“Ì}ÂÝÁ_ß‰èŒ»jò…ÂãÂäÂåñ˜½j‹ŒÂé¬”´aÎ›ñRÁRÂï†áÂñÙIûœÙuß~Ã}²mðzÐUMÂûÂüÂýÂþÖ™Ã¢Ã£Ã¤Ã¥Ã¦Ã§ØˆÃ©å^Ã«Ã¬ãTÃ®Ã¯Ã°Ã±Ã²ÙQüNÃµÃ¶Ã·Ã¹Ãº›]Ã¼Ã½æVÃ¿ÃÀÃÁÃÂÃÃÃÄéTž‚ƒÃÈÃÉÃÊÃËåiÃÍ‰ôÃÏ²[ÃÑÃÒÃÓÃÔÖi›Ã×ÃØÒ’ÃÚÃÛÃÜƒçÃÞÃß¾dÃáÃâÃãÃä¾’ÃæÃçÃèÃéÃêÃëÃìRÃîÃïœçÃñÃòÃóÃô‘‘é}Ã÷ÃøøQã‘ÃûÃüÖ‡ÃþÄ¡Ä¢Ä£Ä¤Ä¥Ä¦Ä§Ä¨Ä©ÄªÄ«Ä¬Ä­Ä®Ä¯Ä°Ö\Ä²Ä³Ä´Äµ®€Ä·Ä¸Ä¹ÄºÄ»Ä¼Ä½Ä¾Ä¿ÄÀÄÁÄÂÄÃÄÄ…ÈâcÄÇÄÈ¼{ÄÊÄËÄÌÄÍÄÎÄÏÄÐëyÄÒ“ÏÄXÀô[Ä×ÄØðHƒÈÄÛÄÜÄÝÄÞÄßÄàÄá”MÄãÄäÄÄæÄçÄèÄéÄêÄë”fÄíÄîÄïá„øBÄòÄóÂ™Äõ‡§è‡æ‡ÄùÄú™ŽªŸÄýŒŽ”QôÅ£Å¤âo¼~Ä“âÞrÅªÅ«Å¬Å­Å®Å¯Å°¯‘Å²Å³Å´ÖZÅ¶šWútšªÅº‡IÅ¼aÅ¾Å¿ÅÀÅÁÅÂÅÃÅÄÅÅÅÆÅÇÅÈÅÉÅÊÅË±PÅÍÅÎÅÏÅÐÅÑÅÒý‹ÅÔÅÕÅÖ’ÅØÅÙÅÚÅÛÅÜÅÝÅÞÅßÅàÅáÙrÅãÅäÅåÅæ‡ŠÅèÅéÅêÅëÅìÅíÅîÅïÅðÅñÅòÅóùiÅõÅöÅ÷ÅøÅùÅúÅûÅüÅýÅþÆ¡Æ¢Æ£Æ¤Æ¥Æ¦Æ§Æ¨Æ©ÆªÆ«Æ¬ò_ïhÆ¯Æ°Æ±Æ²Æ³Æ´îlØšÆ·Æ¸Æ¹ÆºÌOÆ¼Æ½‘{Æ¿ÔuÆÁÆÂŠîHÆÅÆÆÆÇÆÈÆÉÆÊÆËäÆÍÆÎÆÏÆÐÆÑÆÒÆÓÆÔÆÕÆÖ×VÆØÆÙÆÚÆÛ—«ÆÝÆÞÆßœDÆáÆâÆãÆäÆåÆæÆçÆèÆéÄšýRÆìÆíÆîòTÆðØMÆòÆó†¢ÆõÆöÆ÷šâÆù—‰ÆûÆüÓ™ÆþÇ¡Ç¢ ¿Ç¤ãUÇ§ßwºžÇªÖtÇ¬Ç­åXãQÇ°“Ç²œ\×l‰qÇ¶Ç·Ç¸˜Œ†ÜÇ»Ç¼ ËNŠ“ŒÇÁæ@ÇÃÇÄ˜òÇÆ†ÌƒSÇÉÇÊÇËÂNÇÍÇÎ¸[ÇÐÇÑÇÒÇÓ¸`šJÇÖÓHÇØÇÙÇÚÇÛÇÜÇÝŒ‹ÇßÇàÝpšäƒAÇäÇåÇæÇçÇèÇéí•Õˆ‘c­‚¸FÇïÇðÇñÇòÇóÇôÇõÇöÚ……^ÇùÇúÜ|ÇüòŒÇþÈ¡È¢ýxÈ¤È¥È¦ïE™àÈ©ÈªÈ«È¬È­È®È¯„ñÈ±È²È³…sùoÈ¶´_È¸È¹ÈºÈ»È¼È½È¾È¿ÈÀÈÁÈÂ×Œðˆ”_À@ÈÇŸáÈÉÈÊÈËÈÌígÈÎÕJÈÐÈÑ¼xÈÓÈÔÈÕÈÖÈ×ÈØ˜sÈÚÈÛÈÜÈÝ½qÈßÈàÈáÈâÈãÈäÈåÈæÈçÈèÈéÈêÈëÈìÜ›ÈîÈïÈðäJéc™ÈôÈõÈöÈ÷Ë_ÈùöwÈûÙÈýÈý‚ãÉ¢É£É¤†ÊÉ¦ò}’ßÉ©ÉªÉ«­É­É®É¯É°š¢„xÉ³¼†ÉµÉ¶É·ºYÉ¹ÉºÉ»É¼É½„hÉ¿ÉÀéWê„ÉÃÙ ÉÅÉÆÉÇÉÈ¿˜‚ûÉÌÙpÉÎÉÏÉÐÉÑÉÒÉÓÉÔŸýÉÖÉ×ÉØÉÙÉÚÉÛ½BÉÝÙdÉßÉàÉáÉâ”zÉä‘ØÉæÉçÔOÉéÉêÉëÉìÉíÉîÉï¼ÉñÉòŒ‹ðÉõÄIÉ÷BÂ•ÉúÉûÉüÉýÀKÊ¡Ê¢Ê£„ÙÂ}ŽŸÊ§ª{Ê©ñÔŠÊ¬Ê­Ê®Ê¯Ê°•rÊ²Ê³ÎgŒ×RÊ·Ê¸Ê¹Êºñ‚Ê¼Ê½Ê¾Ê¿ÊÀÊÁÊÂÊÃÊÄÊÅ„ÝÊÇÊÈÊÉßmÊËÊÌáŒï—ÊÏÊÐÊÑÊÒÒ•Ô‡ÊÕÊÖÊ×ÊØ‰ÛÊÚÊÛÊÜÊÝ«FÊß˜ÐÊáÊâÊãÝ”ÊåÊæÊçÊè•øÚHÊëÊìÊíÊîÊïÊðÊñÊòÊóŒÙÐgÊö˜äÊøÊùØQÊûÊü”µÊþË¡Ë¢Ë£Ë¤Ë¥Ë¦Ž›Ë¨Ë©ËªëpË¬ÕlË®Ë¯¶Ë±Ë²í˜Ë´Õf´TË· qË¹ËºË»Ë¼Ë½Ë¾½zËÀËÁËÂËÃËÄËÅËÆï•ËÈó Â–‘ZížËÍËÎÔAÕbËÑËÒ”\ËÔÌKËÖË×ËØËÙËÚËÛËÜËÝËÞÔVÃCËáËâËãëmËåëS½—ËèËéšqËëËìËíËîŒO“p¹SËòËóËô¿s¬Ë÷æiËùËúËûËüËýËþ«H“éÌ£Ì¤Ì¥Ì¦Ì§Ì¨Ì©Ì«‘BÌ­Ì®”‚Ø°cž©‰¯Ì´ÌµÌ¶×TÕ„Ì¹ÌºÌ»Ì¼Ì½‡@Ì¿œ«ÌÁÌÂÌÃÌÄÌÅÌÆÌÇÌÈÌÉÌÊÌË CÌÍýÌÏ½dÌÑÌÒÌÓÌÔÌÕÓ‘Ì×ÌØÌÙòvÌÛÖ`ÌÝÌÞÌßäRÌáî}ÌãÌäówÌæÌçÌèÌéÌêŒÏÌìÌíÌîÌïÌðÌñÌòÌóÌô—lÌöÌ÷ÌøÙNèFÌûdÂ ŸNÍ¡Í¢Í£Í¤Í¥Í¦Í§Í¨Í©ÍªÍ«Í¬ã~Í®Í¯Í°Í±Í²½yÍ´ÍµÍ¶î^Í¸Í¹¶dÍ»ˆDÍ½Í¾Í¿ÍÀÍÁÍÂÍÃÍÄˆFÍÆîjÍÈÍ‘ÍÊÍËÍÌÍÍÍÎÍÏÍÐÃ“ørÍÓñWñ„™EÍ×ÍØÍÙÍÚÍÛÍÜ¸DÍÞÍßÒmÍáÍâÍãž³ÍæîBÍèÍéÍêÍëÍìÍíÍîÍïÍðÍñÈfÍóÍôÍõÍöÍ÷¾WÍùÍúÍûÍüÍýÍþÎ¡Î¢Î£ífß`Î¦‡úÎ¨Î©žéžH¾SÈ”Î®Î¯‚¥‚ÎÎ²¾•Î´ÎµÎ¶Î·Î¸Î¹ÎºÎ»Î¼Ö^Î¾Î¿ÐlÎÁœØÎÃÎÄÂ„¼yÎÇ·€ÎÉ†–ÎËÎÌÎÍ“ëÎœu¸CÎÒÎÓÅPÎÕÎÖÎ×†èæužõÎÛÕ_ÎÝŸoÊÎàÎá…ÇÎãÎäÎåÎæÎçÎèÎéÎê‰]ÎììFÎîÎïÎð„ÕÎòÕ`ÎôÎõÎöÎ÷ÎøÎùÎúÎûÎüåa ÞÏ¡Ï¢Ï£Ï¤Ï¥Ï¦Ï§Ï¨Ï©ÏªÏ«Ï¬Ï­ÒuÏ¯Á•Ï±Ï²ãŠÏ´ÏµÏ¶‘ò¼šÏ¹ÎrÏ»Ï¼Ý Ï¾{‚bªMÏÂBÏÄ‡˜ÏÆÏÈÏÉõrÀwÏÌÙtã•ÏÏéeÏÑÏÒÏÓï@ëU¬F«I¿hÏÙðWÁw‘—ÏÝÏÞ¾€ÏàŽûè‚ÏãÏäÏåÏæàlÏèÏéÔ”Ïëí‘Ïíí—ÏïÏðÏñÏòÏóÊ’ÏõÏöÏ÷Ïø‡ÌäNÏûÏüÏý•ÔÐ¡Ð¢Ð£Ð¤‡[Ð¦Ð§Ð¨Ð©ÐªÏÐ¬…f’¶”yÐ°Ð±Ã{ÖCŒ‘ÐµÐ¶Ð·Ð¸Ð¹žaÖxÐ¼Ð½Ð¾ä\ÐÀÐÁÐÂÐÃÐÄÐÅÅgÐÇÐÈÐÉÐÊÅdÐÌÐÍÐÎÐÏÐÐÐÑÐÒÐÓÐÔÐÕÐÖÐ×ÐØÐÙ›°ÐÛÐÜÐÝÐÞÐßÐàÐáçnÐãÐäÀCÐæÐçÐèÌ“‡uíšÐìÔSÐîÐï”¢ÐñÐòÐóÐôÐõÐö¾wÀmÜŽÐúÐû‘ÒÐýÐþßx°_Ñ£½kÑ¥Ñ¦ŒWÑ¨Ñ©Ñª„×Ñ¬Ñ­Ñ®ÔƒŒ¤ñZÑ²Ñ³Ñ´Ó–ÓßdÑ¸‰ºÑºøfø†Ñ½Ñ¾Ñ¿ÑÀÑÁÑÂÑÃÑÄÑÅ†¡†Ó ÑÉÑÊéŽŸŸÑÍû}‡ÀÑÐÑÑÑÒÑÓÑÔîéÑ×ÑØÑÙÑÚÑÛÑÜÑÝÆGÑßÑà…’³ŽÑãÑä©ÑæÑçÖVòžÑêÑëø„Ñí—î“PÑð¯ƒÑòÑóê–ÑõÑöÑ÷ðB˜ÓÑúÑûÑüÑý¬Ž“uˆòßb¸GÖ{Ò¦Ò§Ò¨ËŽÒªÒ«Ò¬Ò­Ò® ”Ò°Ò±Ò²í“Ò´˜IÈ~Ò·Ò¸Ò¹ÒºÒ»Ò¼átÒ¾ãžÒÀÒÁÒÂîUÒÄßzÒÆƒxÒÈÒÉÒÊÒËÒÌÒÍÒÎÏÒÐÒÑÒÒÒÓÒÔË‡ÒÖÒ×ÒØÒÙƒ|ÒÛÒÜÒÝÒÞÒßÒàÒáÒâÒã‘›ÁxÒæÒçÔ„×hÕx×g®ÒíÒîÀ[ÒðÊaÒòÒóÒôêŽÒöÒ÷ãyÒùÒúï‹ÒüÒýë[Ó¡Ó¢™Ñ‹ëú—‘ªÀt¬“Îž IŸÉÏ‰Ó­ÚAÓ¯Ó°·fÓ²Ó³†Ñ“íÓ¶Ó·°bÓ¹ÓºÛxÓ¼ÔÓ¾Ó¿ÓÀÓÁÓÂÓÃÓÄƒžÓÆ‘nÓÈÓÉà]â™ªqÓÍÓÎÓÏÓÐÓÑÓÒÓÓÓÔÕTÓÖÓ×ÓØÓÙì¶ÓÛÓÜÓÝÓÞÝ›ÓàÓáÓâô~ÓäÓåOÓçÓèŠÊÓêÅcŽZÓíÓîÕZÓðÓñÓòÓóÓôÓõÓöÓ÷ÓøÓùÓúÓûªzÓý×uÔ¡Ô¢Ô£îAÔ¥ñSøxœYÔ©ÔªÔ«Ô¬Ô­Ô®Þ@ˆ@†TˆAÔ³Ô´¾‰ßhÔ·îŠÔ¹ÔºÔ»¼sÔ½ÜSè€ÔÀ»›ÔÂ‚é†ÔÅë…ày„òëEÔÊß\ÌNáj•žíÔÐÔÑÔÒësÔÔÔÕžÄÔ×ÝdÔÙÔÚÔÛ”€•ºÙÚEÅKÔáÔâÔãèÔå——ÔçÔèÔéÔêÔëÔìÔíÔîÔïØŸ“ñ„tÉÙ\ÔõÔöÔ÷ÔøÙ›ÔúÔûÔüÔýÜˆåŽélÕ£–ÅÕ¥Õ¦Õ§Õ¨ÔpÕªýSÕ¬Õ­‚ùÕ¯Õ°šÖÕ²Õ³Õ´±K”ØÝšäÕ¹Õº—£×‘ðÕ¾Õ¿¾`ÕÁÕÂÕÃÕÄˆÕÆqÕÈÕÉŽ¤Ù~ÕÌÃ›ÕÎÕÏÕÐÕÑÕÒÕÓÚwÕÕÕÖÕ×ÕØÕÙÕÚÕÛÕÜÏUÞHÕßæNÕáß@ÕãÕäÕåÕæÕçÕèÕéØ‘á˜‚ÉÕíÕîÔ\ÕðÕñæ‚ê‡Õô’ê± Õ÷ªb ŽÕúÕûÕüÕýÕþŽ¬Ö¢àÔ^Ö¥Ö¦Ö§Ö¨Ö©ÖªÖ«Ö¬Ö­Ö®¿—ÂšÖ±Ö²Ö³ˆÌÖµÖ¶Ö·Ö¸Ö¹ÖºëbÖ¼¼ˆÖ¾“´”SÖÁÖÂÖÃŽÃÖÅÖÆÖÇÖÈÖÉÙ|ÖËÖÌœþÖÎÖÏÖÐÖÑÖÒçŠÖÔ½K·NÄ[ÖØÖÙ±ŠÖÛÖÜÖÝÖÞÖaÖàÝSÖâÖãÖä°™Öæ•ƒóEÖéÖêÖëÖìØiÖTÕDÖðÖñ TÖóÖô²š‡ÚÖ÷ÖøÖùÖúÖûÙAèTÖþ×¡×¢×£ñv×¥×¦×§Œ£´uÞD×«Ù×­˜¶×¯ÑbŠy×²‰Ñ î×µåF×·Ù˜‰‹¾YÕ×¼×½×¾×¿×À×Á×Â×Ã×ÄÖø×ÆáÆ×ÉÙY×Ë×Ì×Í×Î×Ï×Ð×Ñ×Ò×Ó×Ôn×Ö×××ØÛ™×Ú¾C¿‚¿vàu×ß×à×á×â×ã×ä×å×æÔ{×è½Mè×ë×ì×í×î×ï×ð×ñ×ò×ó×ô×õ×ö×÷×ø×ùØ¡Ø¢Ø£Ø¤Ø¥Ø¦Ø§ƒØ©ØªØ«Ø¬Ø®Ø°Ø±Ø²Ø³Ø´ØµØ¶Ø·Ø¸Ø¹²GØ½Ø¾Ø¿ØÀØÁÁdØÃ†ÝØÅØÆ…‡ØÈ…˜ØÊìvÚIØÎØÏ…Q…TØÒÙ‘ØÔØÕØ×ØØ„qØÚ„¥„’ØÝØÞØßØàØáØâØãØäØæØèØêØëØìØíØîØð‚øØòØóØôØõ‚t‚áØøÐØúØûØüØýØþÙ¡Ù¢Ù¤Ù¥Ù¦Ù§Ù¨Ù©ÙªÙ«Ù¬ƒŠÙ®ƒzÙ°ƒ‰ƒ°ƒ«Ù´Ùµ‚RÙ·Ù¸Ù¹ÙºÙ»Ù¼Ù½Ù¾Ù¿ÙÁÙÂÙÃÙÄÙÅÙÆƒfÙÈÙÉÙÊÙË‚ôƒEƒ¯ƒ†ƒ®ÙÑÙÒÙÓÙÔÙÕÙÖÙ×ÙØÙÙÙÚÙàÙÜƒLÙÞÙß¼eÙâÙãüZÙå‡ÏÙçÙéÙêÙëøDÙíÙîƒ¼ÙñÐ–ÙóÒCÅLÙö·AÙøÙùÙúÙüÙýÙþ‰VÚ¤Ó“ÓÓ˜ÖŽÔnÔGÔbÔXÔgÔtÔrÕEÕCÔŸÔ‘ÔœÔ–ÔÔÕŠÕŸÔ‚ÕVÕaÕNÕOÕŒÕŽÕ†Õ˜Õ”Õ~ÕrÖRÖGÖoÖ]Ö@ÖIÖXÖOÖBÖJÕ›Öƒ×•ÖqÖuÖkÖ†×v×P×S×H×—×d×Ž„ÚãÚäÚåÚæÚçÚèÚéê€ÚëÚìêŸÚîÚïÚðÚñÚòÚóÚôÚõÚöà—ÚøàwÚúÚûÚüÚýà’Û¡Û¢àPÛ¤Û¥à”Û¨àiáBÛ«Û¬Û­Û®Û¯Û°Û±Û²Û³Û´ÛµÛ¶Û·Û¸Û¹ÛºÆcŠJ„êÛ¾Û¿ÛÀÛÁÛÃÛÄÛÅÛÆÛÇÛËÛÍÛÎÃ^ÛÐˆ×ÛÓÛÔÛÕÛÖÛ×ÛØÛÚ‰¿ÛÜÛÝ‰ÈÛßÛáÛã‰ÀÛåÛæÛçÛèÛéÛêˆºÛìÛí‰NÛïÛòÛóÛô‰Pˆå‰_ÛøÛùÛúÛüÛýÜ¡Ü¢Ü£Ü¤Ü¥Ü¦Ü§Ü©ÜªÜ¬Ü­Ü¯Ü°Ü±Ü²Ü´ÜµÜ¶Ü·Ü¸Ü¹ÜºÜ»ËGÜ½Ü¾Ü¿ÜÀÜÁËžÜÄÜÅÜÆÜÇÇ{ÈOÉÜËÜÌÜÍÜÏÆrÜÒÜÓÜÔÜÖÌdÜØÜÙÜÚÜÛÜÝÜÞÜßÊ\Üâ‰LŸ¦ÜåÜæÜçÜèÊÉœÜëÜìÜíÜîÜïÜðÊwÜòÜóÜôÜõËCÜ÷ÜøËjÜúÜûÜü ÎœîÝ¢Ë|ÉpÈ‡Ý©ÉPÈnÝ¬Ý­Ý®ÉWÝ±Ý³Ý´Ê~Ý¶Ý·Ý¸Ý¹úLÝ¼Ý½Ý¾Ý¿ÝÀÝÂÝÃÝÄÝÅÝÇÝÈÝÉÝÊÝËÝÌÝÍÝÎÝÏÝÐÝÑÝÒ¿MÝÔÝÕÝ×ÝØÝÙÝÚÊrÝÝÊ‰ÝßÝàÝáÝâÝãÊVÝåÝæÝçÝèÝéÝêò‡ÝíÝîÝïÝðÌyÝòÝóÝôÝõÊšÝøÝùÝûÌ`ÝýÌAÞ¡Þ¢Þ£Þ¤Þ¥Þ¦Þ§Þ¨Þ©ÞªÞ«Þ¬ÌIÞ®Þ¯Þ°Þ±Þ²Þ³Ë’ÞµÞ¶Þ·Þ¸Þ¹Ì\Þ¼Þ½Þ¾Þ¿ÞÀÞÂÞÃÞÄÞÅŠYÞÇÞÈÞÉÞÊÞËÞÌÞÍÞÎŒÀ’Ð“»ÞÓÞÔÞÕÞÖÞ×“×ÞÙÞÚÞÛÞÜÞÝÞÞÞßÞàÞá“ÞãÞäÞåÞæÞç“¥ÞéÞë“åÞíÞïÞðÞñÞò”dÞôÞõÞöÞ÷˜^ÞùÞúÞû”tÞýÞþß¡”X”]ß¤”xß§ß¨ß©ßªß«ß¬ß­ß®ß¯sß³‡\ßµß¶ß·ß¸ßº‡`‡Òß¾‡³ßÀ†hßÆßÈßÉßÊßË‡“ßÍßÎßÏßÒßÓ‡}ßÖß×‡^†ôßÚ‡‚ßÝßÞ‡ˆ‡ßãßä‡ßçßè‡Oßê‡Zßìßíßî†îßñßòßóßô‡Kßöß÷‡Êßúßûßýà¡à¢à£à¤à¦à§à¨à©àªà«à¬à®à¯à°à±à²à³à´àµ‡D‡¿à¸à¹à»à¼à½à¾‡ËàÁàÂàÃàÄàÅàÆàÇ‡†àÉàÊàËàÍÞ\àÐàÑàÒ‡ÂàÕàÖà×àÙàÚàÛàÜàÞàß‡£àáàãàäàåàæàéàêàìàîàï‡÷àñàòàóàôàõàöà÷Ž®àùàúàûŽÎŽ¾Ž½á¡á¢á£á¤á¦á§á¨á©áªçá¬sá¯¹á²á³áµá¶á·á¸áºŽFá¼þá¾˜÷ˆáÂáÃáÄáÅáÆáÇáÈŽVáËáÌáÍ£áÏâáÑáÒáÓáÔáÖá×áØáÙáÚŽpáÜáÝáÞáßáàÆáãáäáåáæáçáèáéáìáí«Eáðáñáòáôáõªœá÷ªsáùáúáûáüªáþâ¡â¢â£«Mâ¥â¦â§«Jâ©â«â®â¯â°â±â²â³â´âµâ¶â·â¸â¹ðhï‚ðqïƒï„ï†ïðAðGðNðQðtðxð}ð~ð‚âÏTâÑâÒâÓâÔâÕâÖâ×âØÙsâÚâÛâÜâÝ[âßâáââ‘Ô‘“âå‘Yâçâè÷íâìâíâîâïâðâñâòâóâôâõâöâ÷‘«âù‘Q‘ÃÅðâþã¡Áã£ã¤‘aã¦ã§ã¨ã©ãªÜã¬ã­ã®ã¯ã°ã±ã²‘C‘|ãµã¶ã·ã¸ã¹ãºã»ã¼ã½ã¾ã¿‘¬ãÂãÃãÄéVéZéébéhé`êYé‚é€ôbéé“é‹é”é’é‘é˜é êHêDêIêRãÞãàãáãâž–ãäãåãæãçãèãêãëãìœ¿ãîãïãðž{žoãóãôãöã÷žTãùãúãûãüãý›Üä¡ä¢ä£›Ñœä¦ä§ä¨ä©äªÒä¬ä­ä®žgG¡ä²ä³ä´œZ¬ä·ä¸ä¹ä»ä¼ä½ä¾ä¿äÀäÁž^äÃäÄÆäÆäÇäÈžcäÊœOäÌäÍäÎäÏäÐäÑäÒsäÔäÕäÖä×äØž¹äÚäÛž—äÝž]äßäàäáäã§äåäæäçäèäéäêžužtäîäïäðäñž‡žzäôäõäöä÷äøäùäúäûäüäýž|å¡å¢å£å¤å¥å¦å§å©åªå«å¬å­å®å¯ž®å±å³å´åµå¶å·å¸òqåºå»å¼å½å¾å¿åÀåÂåÃåÄåÅåÆßƒåÈÞŸåÊåËåÌåÍßŠåÏåÐåÑåÒåÓåÔåÕåÖå×åØåÙåÚåÛåÜåÝåÞåßåàåáåâåãåäåååçåèåéåêåëåìåíåîåïŒÕåñ†åóåôåõåöå÷åùåúåû‹³‹žåþæ¡æ¢‹‚æ¤æ¥æ¦æ§æ¨Š™æª‹I‹Ææ­ŒDæ¯æ°æ²æ³‹z‹¹æ¶æ·æ¸æ¹æºæ»æ¼æ½æ¾‹È‹‹æÂæÃæÄæÅæÆæÇ‹Ü‹åæÊæËæÌ‹ÔæÎæÏæÐæÑæÒæÓæÔæÕ‹ßæ×æØæÚæÛæÜæÝæÞæßñzñ†ñ€ò|óAñwñ~ò”ò‘ñ‰óPòUòSòKò‰òsò\òˆòtò~òŠò‹ò–óKóJ¼u¼q¼v¼wÀk¼‹¼„¼‚½C¼œ¼›¿U½E½I½W½{½Ž½‹½¾c¾_¾p¾i¾E¾R¾^¾J¾U¾l¾~¾|¾Ÿ¾˜ÀD¾Œ¾œ¾—¿P¾‡¿N¿b¿d¿c¿r¿O¿VÀ_¿~¿z¿w¿Š¿‰Ài¿¿•À`ÀRÀQÀyçÜçÞçßçà­^¬|çãçä«kçæ­‡çèçéçêçìçíçîíœçðçñçòçó­t¬q­Iç÷çøçùçúçûçüçýçþè¡è¢è£è¤è¥è¦è§­aè©èªè«­‹è­è®è¯è°è±è²è³è´èµ­‘è·ítíyíwè»è¼è½è¾˜q™ÀèÁèÂèÃèÄèÆ—–˜º—nèÊèËèÌèÍ™±èÏ™ÉèÑèÒ™¾èÔèÕèÖè×èØ—dèÚèÛèÜ™µèÞ™fèàèá—¿˜ïèä˜Eèæ˜èèèé˜åèì™uèî™èèñèòèóèôèõèöè÷èø™Ðèúèû™³˜ èþ™åé¢é£˜¡é¥é¦é§é¨é©éªé«é¬™ìé®é±é²é³™Â™°é¶™Îé¸é¹éºé»é¼é½é¾é¿éÀéÁéÂéÃ™‰éÅ™½éÇéÈ™{éÊéËéÌ™ÁéÎéÏéÐéÑéÒéÓéÔéÕ™©é×éØéÙ™´éÛéÜ™_éÞéàš{éãš‘éåšŒššéèš—éêš›éìÜÜ—ÝVÞ_ÝTÝWÝFÞ]ÝUÝYÝeÝbÝ`ÝmÝ‚ÝyÝzÝwÝÞAÞO‘â‘êê©êªê«ê¬ê­ê®‘ìê°®Tê²ê³ê´êµê¶ê¸ê¹êºê»•Òê½ê¾ê¿êÀêÁêÂêÃêÄêÅêÆêÇêÈêÉ•ÏêËêÌ•ŸêÎêÐêÑêÒ•áêÔêÕêÖê×êØêÙÙSÙBÙLÙOÙ—ÙDÙWÚBÙcÙlÙgÙyÙŽÒ—ÓJÒ Ó]ÓDÓMÓPÓUêðêòêôêõêöê÷êøêùêûêüêýêþë¡ë¢ë£ë¥ë¦šÐë¨ë©šÚë«ë¬ë­ë®ë¯ë°ë±šåë³ë´šèë· ©ëºë»ë¼ë½ë¾ëÀëÁëÃëÅëÆëÇëÈ–VÅFëÎëÏƒÙëÑëÒëÓëÔëÕÃ„ë×ëØëÙÄ’ëÝëÞëàÄTëâëãëäëçëèëéëìëíëîÄeëóëôëõëöÄœëøëùëûëüëýëþì¢šeì¤ì¥ì¦ì§ì¨ïRïSïZï`ïjì°Ýžì²ì³ýW”Ìì¶ì·ì¸ì¹ìºì»ì¼ì½Ÿ¬Ÿ˜ŸõìÄìÅìÆŸîìÈìÉìÊ FìÌìÍìÏìÐìÒìÔì×ìØìÙìÚìÛìÜìÝìÞìßìà cìãìäìåìæìçìèìéìëìììíìîìïìðìñ™ìóìôµìöì÷¶Uìùìúìûìüìýìþ‘»í¢í£í¤í¥í¦í§âí©íªí«í¬í­í®‘¿‘ßí²í³Ííµ´‰í·´Xí¹³Œí¼í½í¾íÀµZµaíÄíÆíÇíÈíÉíÊíË³ˆ´“íÎíÏíÑ´ƒíÔíÕíÖ´~íØíÙíÚíÜíÝíßíàíáíâíãíäíåíæµRýíéíêíëíìíííïíðíñíòíóíôíõí÷íø²A²€íûíýíþî¡î¢î£î¤î¥î¦î§î¨î©îªî«î¬î­î®î¯î°î±î²î³®Œîµî·î¸î¹îºî»Á`î¾ÁbîÀîÁîÂîÃááá•á“á‘âQâAáŸå{âOâSââ âkâjâ[â‚â^â€âZâ•ã`â’âŽâ˜â“ãXãfãgâšèpâ‹ãCãBãGâ‰â”èIäDã™ãsäBä…äeçtèKãŸæzãäbäAçfãŒãxæ|ã“åPäCã|ç|ä@ãœç„ånäˆçHä‡ä†ä~äSäsäZäuä|åHäåQä˜åKådäŸåUåOå›å|æJåŠåšæ}æDçUçIæŸækçæyæ„æ‰è\çSçMçNæ çOæ—æ›çCç†çhç…è|ç’çjç‹èZèCèOèsæRïòïóïôïõïöï÷ïøïúïûïüïýïþð¡ð¢·wð¤ð¥ð¦ð§ð¨ð©ðªð«ð¬ð­ð®øFøSødøcøù…ûRøzø|úƒøúvøŽø û[ùPûZù]ùOú’ùYù^ùgùlù‡ù–ù˜ú_úYûWúpúwúú„úú–ú˜ûXðÛ°X°OðÞðàðáðãðæðèðêðë°Aðíðî°Bðððñðòðóðôðõðö°Dðø¯Žðúðûðýðþñ¢ñ£ñ¤ñ¦ñ§°`ñ©ñª°añ¬°]ñ°ñ±°dñ´ñµñ¶ñ·ñ¸ñ¹ñºñ»¸]ñ½ñ¾ñ¿¸MñÁñÃñÄñÅñÆñÇñÈÒdñÊñËñÌÑžñÎÒcÒOñÑñÒñÓñÔñÕñÖñ×ñØñÙÒ@ñÛÒhñÝñÞñßñàñáñâñã°—ñåñæñçñèñéñêñîÂeñðñññóñôñõñöÂœñøÂ˜ñúñûí™í î@îRîMîWîhî€î…ïDî”î‹î—ïAò¯ÍAÏlÏŠò³ò´òµò¶ò·ò¸Í˜òºò»ò¼ò½ò¾ò¿òÀòÁòÂÏ òÄòÅòÆòÇòÈÏ|òÊòËÍÏuòÎÎ‡òÐòÑòÒÏ“òÔòÕòÖò×òØòÙòÚòÛòÜòÝòÞòßòàòáòâòãòäÏXòæòçòèòéòêòëòìÏ”òïòðòòòóòõòöÏNòøòùòúòûòüòþó¡ó¢ó£ó¤ó¥ó¦ó§ó¨ó©óªó«ó¬ó­ó®ó¯ó°ó±ó²ó³ó´ó¶ó·ó¸ó¹óºó»ó¼ÐRó¾À›óÀóÁóÂóÃóÄóÅºVóÇ¹aóÉóÊóËóÌóÍóÎóÏóÐóÑóÒóÓóÔóÕ»eó×óØº`óÚóÛóÜ¹~óÞóßóâóãóäºjºDóçóèóé»Xóëº„óíºóðºˆóòóóóôóõóöó÷óøóùóúóü»fóþô¡ô¢ô£ô¤»[ô¦ô§ô¨ô©ôªô«ô¬ô­ô®Åœô±ô²ô³ô´ÆAô¶ô·ô¹ôºô»ô¼ô½ô¾ô¿ôÀÑUôÂôÃôÄôÅôÆÁuôÈôÉôÊôËôÍôÎôÑôÒôÓôÔôÕ¼RôØôÚôÛôÜôÝôÞôßôàôáôâôãôäôåôæôçôèôé¿{ôëôìôíôîûŸôðôñôòôóôôÚŽôöô÷ôøôùôúôûôüôýôþõ¡õ¢õ¤õ¥á‰á‡õ¨õ©õªõ¬õ­õ®õ¯õ°õ±õ²õ³õ´õµõ¶õ·õ¸õ¹ûzÜOõ¼õ½õ¾õ¿õÀõÁõÂõÃÛ„õÅõÆõÇÜVõÉõÊõËõÌõÍÜEÛ‹õÐÜ]ÜQõÓõÔõÕõÖõ×õØÜWõÚõÛÜUõÞõàõáõâõãõäõåÜbÛ˜õèÜXõêõëõìõíõîÜkõðõñÜgõóõôõõõöõ÷õøõùõúõûÓxõýõþö¡ö¢Ózö¤ö¥ìnö§ìZö©öªìVö¬ö­ö®ö¯ì\ö±ö²ýZýeý_ýfýbýlýrýpý}üwüxüƒö¿öÀëhöÂöÃöÄ×‡öÆèŽöÈçYöÊöËöÌöÎôœô™÷Q÷|·dõV÷cõTõ^õnõb÷qõoõœ÷\õ†÷~ö–öžöˆöœõ…õõŒöaõ›öNöOöEöHöKöFöTõ õ™öl÷{öqövömö—ö’ööŠöŽö˜÷B÷Lö ÷Z÷X÷V÷k÷°÷±í^÷´íd÷¶÷·÷º÷»÷¼úX÷À÷Á÷Âót÷Äóyóx÷Ç÷È÷Éô|ôu÷Ì÷Í÷Îð‹ð÷Ñ÷Ò÷Ó÷Ô÷Õ÷Ö÷×÷Ø÷Ù÷Ú÷Û÷ÜôW÷ß÷àüN÷â÷ã÷ä÷å÷æ÷ç÷è÷é÷ê÷ë÷ì÷í÷î÷ï÷ðüt÷ó÷ôüo÷ö÷÷÷ø÷ùýB÷û÷ü÷ý";  
    }	
}